[
	{"kalimat": "CP 1: menggunakan sintaks dan fungsi di dalam bahasa C++", "type": "cp"},
	{"kalimat": "1. Siswa mampu memahami cara kerja docker container", "type": "cp"},
	{"kalimat": "Setelah mengikuti kuliah ini siswa dapat menjelaskan dan menerapkan prinsip-prinsip perancangan dan usability dalam pengembangan desain interaksi  suatu perangkat lunak.", "type": "cp"},
	{"kalimat": "CP-01: Mampu menjelaskan dan menggambarkan konsep-konsep jaringan komputer. CP-02: Mampu menjelaskan pemanfaatan teknologi jarngan komputer pada kehidupan sehari-hari. CP-03: Mampu menjelaskan fungsi ketujuh layer model referensi OSI dari layer Fisik sampai layer Aplikasi. CP-04: Mampu menjelaskan protokol-protokol jaringan yang digunakan dalam ketujuh layer OSI serta algoritmanya. CP-05: Mampu merancang jaringan komputer lokal (Local Area Network, LAN) baik dari sisi alokasi nomor IP, subnetting,  maupun prinsip instalasi jaringannya. CP-06: Mampu menerapkan algoritma yang dipakai dalam routing statik maupun dinamik sederhana. CP-07: Mampu menjelaskan prinsip kerja protokol-protokol pada layer aplikasi seperti: DNS, HTTP, FTP, dsb. CP-08: Mampu menjelaskan teknologi yang dipergunakan pada jaringan wide area network CP-09: Mengenal konsep dan dasar-dasar teknologi sistem terdistribusi dan cloud computing. CP-10: Mahasiswa memiliki soft skill yang kuat dan lebih percaya diri.", "type": "cp"},
	{"kalimat": "Mahasiswa mampu memahami teknik manajemen proyek dan mengelola pengembangan proyek TI dengan menerapkan konsep pengembangan proyek perangkat lunak .", "type": "cp"},
	{"kalimat": "CP 1 : Menguraikan fungsi dan peran manajemen, menjalankan dan mengelola manajemen dalam lingkungan global, membuat keputusan, lingkungan bisnis, kondisi ekonomi, tanggung jawab sosial dalam bisnis dan bentuk dasar dari kepemilikan bisnis. CP 2 : Menjelaskan tantangan bagi manajer global, proses pengambilan keputusan, tujuan dan perencanaan, strategi bersaing, mekanisme dan struktur organisasi, proses produksi, pemasaran dan keuangan. CP 3 : Menganalisis proses merumuskan tujuan dan perencanaan, proses manajemen strategik, perancangan organisasi yang modern, tempat kerja yang berubah, pengembangan kelompok, dan isu-isu terbaru mengenai motivasi, kepemimpinan, tipe-tipe pengendalian, bauran pemasaran, dan manajemen keuangan. CP 4 : Menerapkan proses inovasi, keanekaragaman tempat kerja, tim yang efektif dan komunikasi antar pribadi, teori motivasi dan kepemimpinan yang modern, alat untuk mengukur kinerja organisasi, dan perencanaan keuangan.", "type": "cp"},
	{"kalimat": "a. Mahasiswa mampu menjelaskan prinsip-prinsip perancangan.", "type": "cp"},
	{"kalimat": "•Menjelaskan akan penting dan kritikalnya keberadaan dokumen Rencana Strategis Sistem dan Teknologi Informasi.", "type": "cp"},
	{"kalimat": "Setelah Mengikuti Perkuliahan Research Statistic, mahasiswa diharapkan:", "type": "cp"},
	{"kalimat": "1. Menjelaskan secara detail peranan dan fungsi strategis TIK bagi perguruan tinggi", "type": "cp"},
	{"kalimat": "Capaian Pembelajaran", "type": "cp"},
	{"kalimat": "1.  Mahasiswa mampu memahamikonsep dasar sistem operasi 2.  Mahasiswa mampu memahami komponendan teknologi sistem operasi 3.  Mahasiswa mampu menjelaskan fungsi sistem operasi 4.  Mahasiswa mampu mengembangkan pengetahuan 5.  Mahasiswa dapat mengkonfigurasi dan mengelola berbagai macam sistem operasi", "type": "cp"},
	{"kalimat": "Mahasiswa mampu meraih nilai A", "type": "cp"},
	{"kalimat": "Mahasiswa mampu menjelaskan berbagai konsep, teori, istilah dalam berbagai macam model sistem temu kembali informasi beserta pengaplikasiannya. Mahasiswa mengimplementasikan teknik-teknik penyelesaian masalah seperti pengindeksan, pencarian, pemrosesan query dalam kebutuhan temu kembali informasi. Mahasiswa mampu mengembangkan sistem yang dapat menemukan dokumen yang relevan dengan kebutuhan pengguna dengan menerapkan prinsip-prinsip dan algoritma yang efektif dan efisien dalam pemilihan dokumen.", "type": "cp"},
	{"kalimat": "Melalui kursus ini, siswa diharapkan memahami pentingnya pengamanan informasi. Selain itu, siswa diharapkan menguasai prinsip-prinsip keamanan informasi dan mengetahui cara mengamankan informasi dengan menggunakan berbagai kendali.", "type": "cp"},
	{"kalimat": "bekerja dengan contoh objek di python. membuat struktur data baru menggunakan pemrograman berorientasi objek. menggunakan objek dengan kontrol dan struktur data sebelumnya. menulis algoritma pencarian umum seperti pencarian linear dan biner. menulis algoritma penyortiran umum seperti semacam penyisipan semacam gelembung dan menggabungkan semacam. mengevaluasi kompleksitas komputasional dari algoritma menggunakan notasi o besar.", "type": "cp"},
	{"kalimat": "bagaimana struktur kontrol dapat mempengaruhi bagaimana garis kode lain dijalankan. conditionals termasuk jika lain jika dan lain untuk alasan yang kompleks. loop termasuk untuk loop untuk masing-masing loop dan sementara loop untuk perilaku berulang. fungsi untuk mengenkapsulasi kode menjadi potongan yang dapat digunakan kembali. penanganan kesalahan untuk mengantisipasi dan menyelesaikan kesalahan yang diharapkan.", "type": "cp"},
	{"kalimat": "string termasuk metode string canggih. tupel dan daftar termasuk daftar multi dimensi. input file dan output termasuk beberapa mode untuk akses file. kamus termasuk mereplikasi penalaran berorientasi objek menggunakan kamus. menggunakan struktur kontrol dengan struktur data seperti pengulangan daftar atau penanganan kesalahan dengan file.", "type": "cp"},
	{"kalimat": "mendeteksi dan memperbaiki kesalahan pemrograman umum pada waktu kompilasi n mendeteksi dan memperbaiki kesalahan pemrograman umum pada saat menjalankan menggunakan alat debugging n tcheck bahwa program melakukan apa yang harus menggunakan proses pengujian unit n menghitung efisiensi dua program dalam hal sumber daya yang digunakan n tmodel program sederhana menggunakan teknik rekayasa perangkat lunak dasar dan menentukan apakah suatu program telah dikembangkan dengan menghormati pertimbangan etis n", "type": "cp"},
	{"kalimat": "memahami sistem informasi manajemen yang salah dan peran mereka di organisasi saat ini dan mengidentifikasi bagaimana salah membentuk dan mengendalikan pekerjaan saat ini atau calon dan bagaimana menggunakan wawasan ini untuk meningkatkan kinerja dan kepuasan kerja Anda sendiri dan dan meningkatkan prospek karir Anda dan tidak akrab dengan tren utama dalam mis dan mis infrastructures cloud big data erps outsourcing dan bagaimana evolusi ini akan mempengaruhi tempat kerja dan strategi bisnis dan menjembatani kesenjangan kedua terkait u201cdigital u201d yang ada setelah literasi komputer dasar di sebagian besar pekerjaan profesional n", "type": "cp"},
	{"kalimat": "mendapatkan keterampilan yang dibutuhkan untuk berhasil sebagai perancang perangkat lunak dan arsitek perangkat lunak. memahami peran seorang arsitek perangkat lunak di dunia digital mempelajari pentingnya menangkap semua kebutuhan pengguna yang penting dan menerapkan u0026ldquo melakukannya sendiri u0026dengan metode untuk merencanakan dan membangun potongan perangkat lunak mengeksplorasi desain perangkat lunak dan menguji aktivitas yang menjawab tantangan baru dari waktu yang berfokus pada teknologi. memahami paradigma interaksi baru kreativitas dan metode desain yang memindahkan fokus dari perangkat lunak ke manusia yang menggunakannya", "type": "cp"},
	{"kalimat": "bagaimana cara menambahkan js js javascript dalam aplikasi web situs web Anda bagaimana mendebugnya dan membuat situs web interaktif melalui api dan tidak mengubah gaya css elemen html5 dari javascript n thow untuk menangani html5 membentuk n thow untuk membuat grafik dasar dan animasi menggunakan html5 kanvas n thow untuk menggunakan konsep dasar es2016 iterasi terakhir dari fungsi array bahasa loop objek dasar n", "type": "cp"},
	{"kalimat": "menjelaskan konsep tensorflow mendasar seperti operasi fungsi utama dan pipeline eksekusi. menggambarkan bagaimana tensorflow dapat digunakan dalam klasifikasi regresi kurva pas dan meminimalkan fungsi kesalahan. memahami berbagai jenis arsitektur yang mendalam seperti jaringan konvolusional jaringan berulang dan autoencoders. menerapkan tensorflow untuk backpropagation untuk menyesuaikan bobot dan bias sementara jaringan saraf sedang dilatih.", "type": "cp"},
	{"kalimat": "r dasar pemrograman n tapplying paket di lingkungan r untuk menentukan perubahan dalam ekspresi gen n tapplying paket di lingkungan r untuk mencari gen dalam urutan genom penuh n", "type": "cp"},
	{"kalimat": "fitur multimedia canggih dengan trek dan webaudio apis html5 permainan teknik lebih apis termasuk pekerja web dan teknik persistensi layanan pekerja untuk penyimpanan data termasuk sistem file indeks api dan drag and drop", "type": "cp"},
	{"kalimat": "lanskap keamanan cyber reverse engineering mengelola dan memonitor jaringan keamanan cyber menyerang forensik komputer malware dan manajemen ancaman gigih ancaman lanjutan dan pentesting", "type": "cp"},
	{"kalimat": "pemahaman mendalam tentang dasar-dasar diagram kelas uml dari pemodelan domain dan pentingnya blok bangunan dasar dari diagram kelas konsep u0022class u0022 u0022attribute u0022 dan u0022association u0022 konsep lanjutan dari u0022inheritance u0022 dan u0022associationclass u0022", "type": "cp"},
	{"kalimat": "konsep probabilitas dasar dan aturan beberapa model probabilitas yang paling banyak digunakan dengan variabel acak diskrit bagaimana model probabilitas bekerja dalam masalah praktis", "type": "cp"},
	{"kalimat": "konsep probabilitas dan aturan beberapa model probabilitas yang paling banyak digunakan dengan variabel acak kontinu bagaimana model distribusi yang kami temui terhubung dengan topik probabilitas distribusi lanjutan normal", "type": "cp"},
	{"kalimat": "memahami bagian-bagian komponen dari jaringan iot dan koneksinya mengevaluasi berbagai komponen infrastruktur dan sistem jaringan menganalisis protokol dan menentukan yang terbaik untuk aplikasi iot yang berbeda mendesain jaringan dasar untuk ide-ide iot Anda sendiri", "type": "cp"},
	{"kalimat": "belajar tentang keterampilan yang diperlukan untuk penelitian dan desain ux memahami bagaimana peneliti ux menemukan dan menilai kebutuhan pengguna mempelajari bagaimana melakukan pengujian kegunaan mikro bagaimana desainer ux mengambil ide dari konsep ke prototipe kerja memahami bagaimana menggabungkan fokus pengguna yang terpusat ke dalam proses desain.", "type": "cp"},
	{"kalimat": "mendefinisikan membedakan dan memberikan contoh perangkat lunak perangkat lunak komputer program algoritma menjelaskan konsep variabel dan menyatakan menginisialisasi dan memodifikasi variabel tipe data int ganda dan char membuat dan komentar program c sederhana yang dapat mencetak teks karakter khusus dan variabel ke layar dengan pemformatan terkontrol membuat program c sederhana yang memanfaatkan loop untuk mengulang blok instruksi", "type": "cp"},
	{"kalimat": "menggunakan kondisi logis untuk mengontrol aliran program melalui pernyataan cabang jika pengulangan lain untuk atau ketika loop dan bersarang dari struktur ini membuat dan memodifikasi array untuk menyimpan bilangan bulat dan floating point dan menjelaskan bagaimana array diatur dalam memori membuat karakter diakhiri null karakter untuk menyimpan dan memodifikasi string karakter semacam dan pencarian array angka dan karakter menggunakan pilihan semacam gelembung semacam pencarian linear dan pembelahan", "type": "cp"},
	{"kalimat": "istirahat tugas pemrograman kompleks u0026nbsp menjadi sejumlah fungsi yang Anda melewati argumen mengingat bagaimana memori komputer diatur untuk menyimpan variabel dan array menemukan alamat variabel u0026nbsp melakukan aritmatika pointer sederhana", "type": "cp"},
	{"kalimat": "memvisualisasikan konsep penunjuk dan menggunakannya untuk meneruskan variabel ke fungsi dengan referensi untuk mengubahnya melalui fungsi menerapkan aritmatika penunjuk agar dapat mengatasi elemen dari array satu dimensi dan multi dimensi menggunakan larik string untuk menyimpan daftar string dalam satu variabel array mengontrol penggunaan memori dengan mengalokasikan secara dinamis dan membebaskan memori saat runtime", "type": "cp"},
	{"kalimat": "menentukan struktur tipe data baru untuk menyimpan beberapa item data dalam satu variabel dan membuat inisialisasi dan memodifikasi variabel jenis baru ini menemukan dan menjelaskan penggunaan memori dari suatu struktur dan menggunakan pointer ke struktur dan operator pemilihan anggota langsung dan tidak langsung untuk mengakses anggota struktur membuat daftar terkait struktur dengan alokasi memori dinamis pada saat runtime atau mencari daftar struktur berjajar", "type": "cp"},
	{"kalimat": "menempatkan pada timeline tanggal-tanggal kunci dari penciptaan unix dan linux menggunakan perintah-perintah dasar untuk mengontrol sistem operasi linux menavigasi dan memanipulasi filesystem linux menggunakan antarmuka baris perintah mengatur memori dan proses yang berjalan di linux mengkompilasi dan menjalankan program c di linux", "type": "cp"},
	{"kalimat": "gunakan pustaka eksternal buat aplikasi dari berbagai file sumber yang mengotomatiskan proses pembuatan menggunakan makefile lewat dan gunakan argumen ke fungsi utama baca dari dan tulis ke file di c gunakan alat pengembangan profesional u0026nbsp dalam sistem operasi linux", "type": "cp"},
	{"kalimat": "cara efektif menggunakan proyek microsoft dalam microsoft office 365 cara berhasil merencanakan dan merancang proyek Anda dalam praktik terbaik proyek microsoft dalam menggunakan proyek microsoft", "type": "cp"},
	{"kalimat": "pengembangan portofolio dari perspektif strategi bisnis n thow untuk mengelola jadwal yang kompleks n tmethods untuk mengatasi masalah dan risiko menggunakan microsoft ppm n", "type": "cp"},
	{"kalimat": "memungkinkan pengguna untuk tim microsoft mengkonfigurasi tim microsoft mengkonfigurasi audio conferencing dengan tim. praktik terbaik untuk menggunakan tim microsoft.", "type": "cp"},
	{"kalimat": "merancang skema database relasional ternormalisasi dan mengimplementasikan tabel yang memastikan integritas data melalui batasan membuat indeks mengimplementasikan pandangan", "type": "cp"},
	{"kalimat": "mengoptimalkan alat dan teknik basis data Anda untuk memantau dan menyesuaikan metode penyetelan khusus lingkungan untuk mengoptimalkan kinerja basis data", "type": "cp"},
	{"kalimat": "memetakan persyaratan pelaporan bisnis ke dimensi dimensi entitas data logis dan tabel fakta dalam strategi pengindeksan skema bintang dan partisi untuk menyediakan kinerja dan pemuatan skala gudang data dengan ekstrak transformasi dan teknik beban etl", "type": "cp"},
	{"kalimat": "Anda akan mempelajari prinsip-prinsip desain dan solusi untuk memutuskan pemuatan penuh atau inkremental mengisolasi data etl menciptakan etl script dan abstraksi lapisan kontrol lingkungan desain mengalir sumber data transformasi data tujuan data preseden kendala manajer koneksi mengeksekusi tugas-tugas sql hasil eksekusi eksekusi ulang data database tujuan alur alur aliran data mengalir alur data konfigurasi sumber data dan tujuan melaksanakan paket ssis menyebarkan paket ssis", "type": "cp"},
	{"kalimat": "memahami dan menggunakan tawaran layanan keamanan tambahan dalam biru dan intuneunderstanding dari ikhtisar arsitektur biru langit biru berikut jaringan keamanan jaringan keamanan jaringan aman pemantauan akses remote dan referensi deteksi ancaman arsitektur belajar tentang keamanan beban kerja ias memahami fitur dari pusat keamanan biru meninjau bagaimana biru berurusan dengan penolakan didistribusikan layanan ddos ​​serangan pemeriksaan anti malware biru memahami intune microsoft untuk windows ios dan perangkat android mdm mam data governance dengan gdpr autopilot", "type": "cp"},
	{"kalimat": "bagaimana melakukan wawancara mendalam u0026amp survei lain untuk memahami cara pengguna untuk mensintesis ide menjadi produk yang kohesif dan praktis dari alat prototyping sederhana untuk dengan cepat mengiterasi desain bagaimana merancang antarmuka pengguna yang disesuaikan agar mudah u0026amp efisien", "type": "cp"},
	{"kalimat": "bentuk logis dan bagaimana membangun argumen deduktif dan bentuk argumen induktif u0026nbsp dasar-dasar pemikiran kritis bagaimana memecah masalah menjadi tugas yang lebih sederhana mengenali pola dan memahami mengapa ini penting bagaimana menggunakan algoritma untuk memecahkan masalah hubungan logika dengan fundamental di komputer ilmu", "type": "cp"},
	{"kalimat": "python 3 fundamental string dan metode manipulasi daftar untuk iterasi melalui daftar string dan rentang menciptakan membaca dan menulis ke file", "type": "cp"},
	{"kalimat": "bekerja dengan kode yang disimpan dalam sistem kontrol versi seperti git. meningkatkan kode dan membuatnya lebih mudah dipahami menggunakan refactoring kode komentar konvensi penamaan dan dokumentasi. memperbarui basis kode yang ada. kode dengan keyakinan dengan bantuan tes unit. memberi dan menerima umpan balik yang berarti dalam ulasan kode rekan. berkontribusi untuk proyek open source software oss di github. pelajari cara menjaga kode Anda tetap aman dan hormati privasi u0026rsquo pengguna Anda.", "type": "cp"},
	{"kalimat": "advanced c ++ mechanics c ++ exceptions c ++ object iterators c ++ templates c ++ classes c ++ pola desain", "type": "cp"},
	{"kalimat": "c ++ syntax n tc ++ bahasa fundamental n thow untuk membuat fungsi di c ++ n mempersiapkan diri untuk intermediate dan advanced c ++ topics dalam mengikuti kursus yang diajarkan oleh microsoft n", "type": "cp"},
	{"kalimat": "sejarah dan konsep dasar di belakang sudut n untuk membangun komponen dan template html n dasar-dasar komponen siklus hidup n thow untuk menggunakan fitur-fitur typcript dengan sudut n", "type": "cp"},
	{"kalimat": "layanan aplikasi azure biru dasar dan konsep portal biru n menciptakan aplikasi web biru dan menyebarkan kode ke situs web biru n memanfaatkan wawasan aplikasi dan query data telemetri n timplementing penyebaran berkelanjutan dan skenario otomatisasi sumber daya. n ttesting debugging dan logging untuk aplikasi web aplikasi layanan biru n", "type": "cp"},
	{"kalimat": "iot dan teknologi data hub iot hub biru dan penyimpanan data analitis aliran biru dan visualisasi dengan documentdb dan manajemen daya perangkat jauh bi", "type": "cp"},
	{"kalimat": "asynchronous fundamental n thow untuk menggunakan javascript menjanjikan n thow untuk menggunakan fetch api n thow untuk menggunakan generator javascript n", "type": "cp"},
	{"kalimat": "layanan yang tenang n tweb api n tasp.net core n tcors n", "type": "cp"},
	{"kalimat": "konsep inti MVC cara membuat model cara membuat pengendali cara memperbarui tampilan", "type": "cp"},
	{"kalimat": "cara mengatur proyek node.js menggunakan npm cara menggunakan modul inti node.js cara menggunakan express untuk menyiapkan server web cara menggunakan mongodb untuk menyimpan data dalam basis data cara menggunakan luwak untuk memodelkan skema basis data", "type": "cp"},
	{"kalimat": "menggunakan pustaka termasuk math os datetime membuat penanganan error pernyataan yang akurat dan kuat termasuk mencoba kecuali tuple dan struktur data kamus konfigurasi file python .py untuk digunakan kembali dalam kode dan di dalam struktur dokumen pendokumentasian terminal", "type": "cp"},
	{"kalimat": "cara membuat dan mengonfigurasi grup pengguna dan akun komputer bagaimana mengimplementasikan objek kebijakan grup untuk menegakkan proses standar di organisasi Anda", "type": "cp"},
	{"kalimat": "windows server 2016 instalasi dan opsi instalasi termasuk server nano. komponen logis dari ds ds seperti hutan domain situs dan trust. komponen fisik dari ds ds seperti pengontrol domain dan server katalog global. administrasi server jendela termasuk cadangan dan pemulihan perkakas.", "type": "cp"},
	{"kalimat": "apa yang windows powershell dan bagaimana mengakses alat melalui konsol dan lingkungan scripting yang terintegrasi ise. n thow untuk menggunakan bantuan jendela powershell dan sintaks perintah dasar. n thow pipeline berfungsi dan bagaimana menemukan anggota objek. n thow untuk menggunakan operator perbandingan penyaringan dan enumerasi. n thow untuk mendefinisikan dan menggunakan variabel dan array. n thow untuk mengakses psproviders dan psdrives termasuk penyedia sistem file. n thow untuk menggunakan format output dasar dan lanjutan. n thow untuk mengarahkan output dan bagaimana menggunakan tampilan grid. n", "type": "cp"},
	{"kalimat": "bagaimana iaas menggunakan mesin virtual dan konsep dasar dari endpoint dan ip addressing. cara menentukan beban kerja mesin virtual dan mengukur dengan benar mesin virtual Anda. bagaimana merencanakan membuat dan menyebarkan mesin virtual jendela biru. cara mengkonfigurasi alamat IP mesin virtual ketersediaan skalabilitas dan keamanan. bagaimana mengelola impor pasang dan ekspor disk virtual.", "type": "cp"},
	{"kalimat": "bagaimana merencanakan jaringan virtual di microsoft biru. bagaimana menerapkan dan mengelola jaringan virtual. cara mengkonfigurasi konektivitas antar situs dengan jaringan virtual microsoft biru.", "type": "cp"},
	{"kalimat": "cara membuat dan mengelola direktori iklan direktori aktif biru. cara menerapkan aplikasi di iklan biru. cara memperpanjang iklan internal ke warna biru. cara mengkonfigurasi otentikasi multi faktor.", "type": "cp"},
	{"kalimat": "cara merencanakan penyimpanan biru termasuk pilihan penyimpanan yang paling sesuai untuk skenario tertentu dan untuk permintaan penyimpanan yang dapat ditagih, serta persyaratan pencadangan dan pemulihan. cara menerapkan dan mengelola penyimpanan biru termasuk membuat akun penyimpanan dan memilih alat akses penyimpanan. bagaimana menerapkan tabel gumpalan dan antrian dan file biru. cara memantau penyimpanan dan menerapkan pencadangan biru.", "type": "cp"},
	{"kalimat": "cara mendeskripsikan aplikasi layanan biru aplikasi web menggunakan layanan aplikasi biru bagaimana mengelola aplikasi web yang diterapkan dan penyebaran pekerjaan web dari aplikasi seluler bagaimana mengelola penerapan aplikasi seluler cara membuat dan memodifikasi template lengan untuk digunakan dengan penerapan layanan aplikasi", "type": "cp"},
	{"kalimat": "konsep dasar untuk desain perangkat lunak globalisasi lokalisasi pasar kebutuhan regional dan perbedaan bahasa pemasaran ux desain desain sentris manusia kulturalisasi merancang skenario dunia siap desain permainan pengembangan perangkat lunak manipulasi input data dan rekayasa tampilan u0026amp lokalisasi pendekatan pengembangan lingkungan globalisasi apis dan layanan web", "type": "cp"},
	{"kalimat": "didistribusikan dasar-dasar aplikasi cloud termasuk mengapa aplikasi cloud merangkul orkestra kegagalan ketika membagi monolith ke layanan microservices 12 faktor dan kapan dan bagaimana menggunakan kontainer. komunikasi jaringan termasuk skalabilitas layanan dan ketersediaan cara menentukan mengelola apip titik akhir layanan versi dan cara melakukan komunikasi jaringan toleran kesalahan. komunikasi pesan termasuk manfaat olahpesan dengan antrian dan pemrosesan pesan toleran kesalahan. upgrade dan konfigurasi versi termasuk berbagai cara untuk mengversi layanan Anda u0026rsquo s code cara mematikan contoh layanan dengan anggun dan cara mengkonfigurasi dan berbagi rahasia dengan layanan yang berjalan. layanan penyimpanan data termasuk pertimbangan layanan penyimpanan objek penyimpanan file layanan database relasional dan non relasional partisi replika pola konsistensi akhirnya cqrs event sourcing saga pola konkurensi dan skema data versi. pemulihan bencana termasuk cadangan memulihkan titik pemulihan dan tujuan waktu serta aktif arsitektur aktif aktif dan pasif.", "type": "cp"},
	{"kalimat": "bagaimana identitas adalah pesawat kontrol baru perimeter yang menggantikan firewall. langkah-langkah yang disarankan untuk mengamankan direktori aktif. arsitektur keamanan biru dan federasi identitas dan solusi akses yang didukung oleh arsitektur biru. bagaimana fungsi sertifikasi atribut kerberos dan privilege.", "type": "cp"},
	{"kalimat": "Setelah menyelesaikan kursus ini, siswa akan dapat memahami arsitektur powerhell menyebarkan PowerShell keamanan operasional menganalisis pengauditan PowerShell dan logging meningkatkan manajemen server dengan konfigurasi negara yang diinginkan dan hanya cukup administrasi. menganalisis dan debug skrip memahami eksploitasi berbasis powershell dan remediasinya.", "type": "cp"},
	{"kalimat": "setelah menyelesaikan kursus ini siswa akan dapat menggambarkan lanskap keamanan perusahaan saat ini mendefinisikan pendekatan kompromi yang diasumsikan melatih tim merah versus latihan tim biru mengembangkan proses persiapan dan respons keamanan organisasi", "type": "cp"},
	{"kalimat": "Setelah menyelesaikan kursus ini, para siswa akan dapat menjelaskan metode deteksi heuristik berdasarkan tanda tangan dan perilaku, kemampuan dari pada deteksi ancaman prasejarah dan alat mitigasi menyebutkan kemampuan deteksi ancaman dan alat mitigasi hibrida dan awan mengenali pentingnya pemantauan deteksi ancaman perusahaan.", "type": "cp"},
	{"kalimat": "setelah menyelesaikan kursus ini siswa akan dapat secara efektif memprioritaskan respon terhadap insiden keamanan membangun tim respon insiden keamanan komputer csirt mengembangkan daftar rencana tindakan tanggapan insiden kegiatan pasca insiden yang tepat", "type": "cp"},
	{"kalimat": "bagaimana merencanakan dan mempersiapkan penyebaran server sql dan tugas database sql biru dan langkah-langkah yang diperlukan untuk menyebarkan server sql pada windows di linux dan dalam pengujian database imigrasi sql sql dan alat-alat kompatibilitas tugas dan langkah-langkah yang diperlukan untuk bermigrasi database sql server di seluruh platform versi dan operasi sistem", "type": "cp"},
	{"kalimat": "dalam kursus ini Anda akan mempelajari teori dan teknik untuk memilih model arsitektur yang tepat mengimpor data untuk membuat tabel dan mendefinisikan hubungan yang meningkatkan desain model dengan fitur kegunaan meningkatkan desain model dengan logika bisnis mengelola database tabular merancang untuk directquery mode menyebarkan ke layanan analisis biru membandingkan tabular dan model multidimensional", "type": "cp"},
	{"kalimat": "manfaat dari manajemen data master mdm n tsql server 2016 layanan data master kemampuan mds dan fitur n pengembangan model mds n nmanajemen data master n tmanaging model versioning n tintegrating data master n tadministering mds n tsecuring mds n", "type": "cp"},
	{"kalimat": "bagaimana aliran powerapps dan layanan data umum digunakan dan di mana mereka cocok dalam memecahkan skenario bisnis menghasilkan aplikasi bisnis yang bekerja pada ponsel tablet dan browser terhubung ke berbagai sumber data seperti daftar di sharepoint tabel excel pada onedrive database sql dan banyak lagi. mengotomatiskan alur kerja berulang menggunakan aliran microsoft", "type": "cp"},
	{"kalimat": "Dasar-dasar normalisasi dan mengapa hal itu penting untuk database transaksional bagaimana mengembangkan model data fisik dan logis bagaimana memodelkan privasi keamanan data dan persyaratan perlindungan kapan dan di mana untuk memodelkan persyaratan kinerja spesifik database bagaimana pengembangan model didorong cocok dalam lingkungan devils atau lincah bagaimana hindari pergeseran skema dan pola anti data lainnya", "type": "cp"},
	{"kalimat": "c sintaksis c bahasa fundamental iterasi di c membuat keputusan dalam kode c", "type": "cp"},
	{"kalimat": "inti konsep pemrograman berorientasi objek bagaimana membuat dan menggunakan kelas dan objek dalam aplikasi c menerapkan tiga konsep inti oop menggunakan c pegang memori dan manajemen sumber daya di c dan kerangka bersih.", "type": "cp"},
	{"kalimat": "c struktur data sederhana dan kompleks bagaimana mengimplementasikan berbagai struktur data di c bagaimana mengimplementasikan sort dan algoritma pencarian di c", "type": "cp"},
	{"kalimat": "c ++ pointer n tc ++ jenis referensi n manajemen memori dalam c + + n konsep oop yang lebih dalam c ++ n tworking dengan stream dan file untuk operasi input output n", "type": "cp"},
	{"kalimat": "menjelaskan dan menerapkan pengetahuan dari jaringan saraf dalam dan metode pembelajaran mesin terkait tahu bagaimana menggunakan python dan python perpustakaan seperti numpy dan panda bersama dengan perpustakaan pytorch untuk aplikasi pembelajaran mendalam membangun jaringan saraf dalam menggunakan pytorch.", "type": "cp"},
	{"kalimat": "bagaimana merencanakan untuk menyebarkan dan menyediakan database sql biru. bagaimana menerapkan aman dan mengelola database sql biru. bagaimana menggunakan metrik peringatan audit dan pandangan manajemen dinamis untuk memantau database sql biru. cara menggunakan gudang data sql biru untuk solusi data besar.", "type": "cp"},
	{"kalimat": "membedakan antara skenario migrasi yang berbeda dan memahami kapan migrasi perlu dibangun kembali dalam azure. u0026nbsp merencanakan migrasi dengan benar untuk memastikan sumber daya yang dimigrasikan dapat didukung dalam warna biru. bagaimana memilih dan mengkonfigurasi akun penyimpanan yang benar dan jaringan virtual biru. memastikan beban kerja aman dan dapat dipulihkan melalui replikasi dari pada server lokal menggunakan asr pemulihan situs biru.", "type": "cp"},
	{"kalimat": "bagaimana microsoft azure menyediakan transparansi privasi keamanan dan kepatuhan dengan pusat kepercayaan microsoft biru bagaimana mengelola dan menerapkan sertifikat di microsoft azure bagaimana menerapkan kunci biru azure untuk melindungi aplikasi dan layanan cloud cara melindungi mendeteksi dan menanggapi ancaman menggunakan pusat keamanan biru microsoft", "type": "cp"},
	{"kalimat": "menangkap data waktu nyata dengan hub kejadian biru dan hub iot memproses data waktu nyata dengan data agregasi aliran biru di data sementara pemantauan solusi streaming di biru", "type": "cp"},
	{"kalimat": "membuat alur kerja data dengan aliran data pabrik data penjadwalan biru untuk mengatur proses data besar yang menerapkan transformasi data dalam saluran pipa dengan sarang atau u sql", "type": "cp"},
	{"kalimat": "bagaimana kurikulum data besar microsoft bekerja pengantar untuk format data teknologi dan teknik dasar-dasar dasar-dasar prinsip-prinsip dasar untuk bekerja dengan data besar", "type": "cp"},
	{"kalimat": "komponen jaringan saraf yang dalam dan bagaimana mereka bekerja bersama jenis dasar jaringan saraf dalam mlp cnn rnn lstm dan jenis data masing-masing dirancang untuk pengetahuan yang bekerja konsep kosakata dan algoritma yang digunakan dalam pembelajaran mendalam bagaimana membangun akhir untuk model akhir untuk mengenali gambar-gambar angka yang ditulis tangan menggunakan regresi logistik multi-kelas dan mlp multi layered perceptron model jaringan neural konvolusi cnn untuk peningkatan pengenalan digit dan model jaringan neural rekursif rnn untuk meramalkan data deret waktu dan model memori jangka pendek jangka panjang untuk memproses sekuensial data teks", "type": "cp"},
	{"kalimat": "Anda akan belajar bagaimana mengotentikasi koneksi dan login pengguna bagaimana mengotorisasi pengguna untuk mengakses sumber daya bagaimana mengaudit akses ke data bagaimana mengenkripsi data saat istirahat dan melalui kawat", "type": "cp"},
	{"kalimat": "penguatan belajar masalah proses pengambilan keputusan markov bandit pemrograman dinamis perbedaan temporal belajar pendekatan perkiraan metode kebijakan gradien dan aktor kritik rl yang bekerja", "type": "cp"},
	{"kalimat": "Dalam kursus ini Anda akan belajar bagaimana membangun model pembelajaran mesin sederhana dengan pembelajaran mesin biru menggunakan python dan layanan kognitif microsoft untuk bekerja dengan gambar pidato teks dan video menggunakan kerangka bot microsoft untuk menerapkan bot percakapan.", "type": "cp"},
	{"kalimat": "menggunakan python di notebook jupyter mengumpulkan input dan memanipulasi input output membangun fungsi reusable dengan parameter dan mengembalikan nilai-nilai keputusan dan pengulangan menggunakan pernyataan kondisional dan loop", "type": "cp"},
	{"kalimat": "apa pengembangan front end web adalah semua tentang bahasa yang berbeda yang digunakan dalam arena pengembangan ini belajar tentang kerangka yang digunakan saat ini dan bagaimana mereka berlaku untuk pengembangan web mencoba beberapa alat yang tersedia untuk pengembang web", "type": "cp"},
	{"kalimat": "jenis dalam typescript n tprogramming di typescript n tmodules dan namespaces n topik yang tadvanced dalam naskah n", "type": "cp"},
	{"kalimat": "cara menggunakan sintaks jsx untuk membuat elemen reaksi bagaimana membangun aplikasi bereaksi menggunakan komponen reaksi bagaimana mengatur metode keadaan dan siklus hidup komponen reaksi bagaimana membuat daftar dan bentuk menggunakan komponen reaksi", "type": "cp"},
	{"kalimat": "menangani routing menggunakan router bereaksi menyederhanakan manajemen negara menggunakan redux mengintegrasikan redux dengan aplikasi reaksi yang ada", "type": "cp"},
	{"kalimat": "memahami sudut dan cara kerjanya cara mengatur lingkungan pengembangan u0026nbsp typescript dalam bentuk sudut", "type": "cp"},
	{"kalimat": "bentuk-bentuk konsep sudut yang canggih dengan komponen-komponen lanjutan angjangan yang bekerja dengan produksi yang dibangun", "type": "cp"},
	{"kalimat": "merencanakan dan mengkonfigurasi otentikasi berdasarkan proses infrastruktur dan manajemen metode rencana perizinan dan konfigurasi platform dan manajemen keamanan pertanian dari penyediaan profil pengguna dan konfigurasi aplikasi web", "type": "cp"},
	{"kalimat": "memahami ancaman dan pelanggaran data yang menargetkan data Anda. menerapkan perlindungan ancaman canggih 365 kantor. mengimplementasikan menggunakan intelijen ancaman kantor 365. mengkonfigurasi audit memperingatkan dan melaporkan di kantor 365. menggunakan manajemen keamanan tingkat lanjut di kantor 365", "type": "cp"},
	{"kalimat": "memperkenalkan peran agen dukungan u0026nbsp mengidentifikasi prioritas inti dan tanggung jawab utama dari agen dukungan meningkatkan keterampilan dukungan Anda dengan berinteraksi dengan peran lain mengidentifikasi keterampilan kinerja yang harus dikuasai oleh agen pendukung yang memahami apa yang mendorong perilaku pelanggan saat berinteraksi dengan agen dukungan untuk memeriksa bagaimana dimensi budaya dan gaya komunikasi mempengaruhi perilaku pelanggan belajar bagaimana budaya yang berbeda memandang waktu memeriksa tahap dasar itu mendukung manajemen kasus", "type": "cp"},
	{"kalimat": "memperkenalkan strategi komunikasi yang efektif u0026nbsp mengembangkan hubungan dengan pelanggan Anda menafsirkan dan parafrase pelanggan pesan u0026rsquo menunjukkan empati terhadap ulasan pelanggan Anda etiket percakapan praktik terbaik berkomunikasi di tingkat pelanggan u0026rsquo yang membedakan antara pesan pelanggan implisit vs eksplisit memahami bagaimana menanggapi secara efektif melalui obrolan email telepon dan media sosial memuaskan pelanggan yang menantang dan meredakan kemarahan pelanggan", "type": "cp"},
	{"kalimat": "Tinjau langkah-langkah yang terlibat dalam pemecahan masalah kasus dukungan pelanggan memeriksa praktik terbaik saat menetapkan masalah dan bagaimana menangani misroutes memahami apa masalah pelingkupan adalah mengapa Anda harus mengatasi masalah dan langkah-langkah yang terlibat dalam pelingkupan kasus mengidentifikasi bagaimana menemukan solusi berdasarkan pada jenis insiden yang Anda hadapi saat berurusan dengan cara mengumpulkan bukti dan cara mempersempit penelitian Anda memahami cara melaksanakan rencana pemecahan masalah dari berkolaborasi dengan agen dukungan lain untuk mentransfer kasus ke peningkatan kasus belajar bagaimana memvalidasi solusi Anda mempertahankan kepuasan pelanggan dan menutup sebuah kasus memeriksa praktik terbaik pemecahan masalah termasuk bagaimana menggunakan matriks solusi analitis ketika mengembangkan solusi memahami bagaimana mengelola harapan pelanggan dan bagaimana mengelola keberatan pelanggan untuk solusi yang diusulkan", "type": "cp"},
	{"kalimat": "memahami apa yang dimaksud dengan kasus penasehat dan mengidentifikasi persyaratan utama yang harus didokumentasikan untuk kasus seperti itu memahami apa kasus reaktif dan mengidentifikasi persyaratan utama yang harus didokumentasikan untuk kasus seperti itu memahami persyaratan utama apa yang harus didokumentasikan ketika meningkat kasus serta kapan harus melakukan transfer hangat memeriksa jenis alat yang biasanya digunakan untuk menangkap data pelanggan mengidentifikasi pertanyaan utama yang harus ditanyakan selama fase yang berbeda dari siklus hidup manajemen kasus mengidentifikasi pertanyaan utama yang harus ditanyakan ketika menghadapi masalah khusus. situasi", "type": "cp"},
	{"kalimat": "mempersiapkan untuk menginstal windows 10 menginstal windows 10 mengkonfigurasi perangkat dan driver perangkat. melakukan posting konfigurasi konfigurasi tugas-tugas personalisasi windows 10 aplikasi implementasi", "type": "cp"},
	{"kalimat": "mengatur pembaruan windows. melakukan pemeliharaan dan kinerja sistem di windows 10 mengonfigurasikan pemulihan cadangan dan pemulihan sistem dan data di windows 10. mengkonfigurasi perangkat manajemen tingkat lanjut. deskripsikan teknik mitigasi dan penghindaran malware.", "type": "cp"},
	{"kalimat": "konfigurasikan jaringan untuk windows 10. konfigurasikan penyimpanan untuk windows 10. konfigurasikan akses dan penggunaan data di windows 10. konfigurasikan remote management di windows 10. konfigurasikan otorisasi dan otentikasi.", "type": "cp"},
	{"kalimat": "pemecahan masalah instalasi windows menggunakan pemecahan masalah windows dan alat pemantauan pemecahan masalah pengaturan browser web pemecahan masalah instalasi aplikasi pemecahan masalah otentikasi windows", "type": "cp"},
	{"kalimat": "mendeskripsikan perangkat komputasi yang memahami komponen perangkat keras pc dan laptop memecahkan masalah perangkat keras umum menjelajahi perangkat seluler dan yang terhubung memecahkan masalah perangkat seluler umum dan masalah perangkat yang terhubung", "type": "cp"},
	{"kalimat": "menerapkan teknik analisis gambar klasik seperti deteksi tepi u0026nbsp u0026nbsp DAS dan transformasi jarak serta k berarti pengelompokan untuk membagi dataset dasar. mengimplementasikan algoritma analisis citra klasik menggunakan perpustakaan OpenCV. membandingkan teknik klasifikasi objek pembelajaran klasik dan mendalam. menerapkan microsoft resnet dalam jaringan saraf convolutional cnn ke objek klasifikasi menggunakan toolkit kognitif microsoft. menerapkan pembelajaran transfer untuk menambah resnet18 untuk jaringan fcn sepenuhnya konvolusi untuk segmentasi semantik.", "type": "cp"},
	{"kalimat": "Dasar-dasar pengenalan suara pemrosesan sinyal dasar untuk pengenalan suara pemodelan akustik dan pelabelan algoritma umum untuk bahasa pemodelan decoding fitur akustik ke dalam pidato", "type": "cp"},
	{"kalimat": "cara mengonfigurasi dan mengimplementasikan akun otomatisasi biru dan keamanan cara membuat dan menjalankan jendela otomatisasi men-powerhell alur kerja buku teks berbasis alur kerja untuk menyediakan dan menyediakan lingkungan yang diinginkan dsc konfigurasi negara dan cara membuat file konfigurasi dsc mengimpornya ke akun otomatisasi dan kompilasi. cara onboard azure vms untuk otomatisasi dsc cara menghasilkan template lengan manajer sumber daya biru berdasarkan grup sumber daya yang ada dan menerapkan u0026nbsp template lengan yang menghapus semua sumber daya dalam kelompok sumber daya cara membuat template lengan dengan menggunakan visual studio. bagaimana menerapkan koki dan penyebaran boneka di biru bagaimana menggunakan koki untuk mengkonfigurasi lab devtest devitest bagaimana mengkonfigurasi integrasi berkelanjutan dan penyebaran berkelanjutan dari database sql biru menggunakan visual studio layanan tim vsts dan visual studio.", "type": "cp"},
	{"kalimat": "sifat saat ini dari ancaman keamanan lansekap arsitektur keamanan baru dan fitur windows 10 yang mengurangi ancaman ancaman u0026nbsp ke dalam layanan keamanan dibundel dengan windows 10 edisi terbaru pengetahuan tentang infrastruktur keamanan eksternal yang mendukung baseline keamanan baru yang dapat dikonfigurasi menggunakan objek kebijakan grup gpo", "type": "cp"},
	{"kalimat": "mengkonfigurasi opsi kontrol git dan tfvc versi untuk integrasi berkelanjutan bagaimana mengelola hutang teknis dan sumber serta dampaknya. u0026nbsp cara membuat build integrasi berkesinambungan menggunakan opsi integrasi manajemen paket vsts seperti nuget semver gitversion dan lainnya. agen dan saluran pipa termasuk cara melepaskan jalur pipa u0026nbsp pengiriman terus-menerus dan strategi manajemen rilis mengintegrasikan pengujian otomatis ke dalam jalur pipa rilis Anda menggunakan pengujian miku ui pengujian microsoft test manager memahami berbagai ketersediaan dan opsi pengujian kinerja penyediaan otomatis dan penyediaan infrastruktur dan database d kelompok penyebaran bendera fitur dan penyebaran database otomatisasi pemulihan dalam pipa rilis penyebaran berkelanjutan dengan Jenkins dan vsts", "type": "cp"},
	{"kalimat": "membuat gambar penampung mengelola beberapa penampung menggunakan alat seperti buruh pelabuhan cara menyiapkan kluster produksi untuk meng-host kontainer Anda, menerapkan aplikasi yang dikemas ke orkestra yang berbeda yang tersedia dalam layanan kontainer biru, yaitu dc os docker swarm dan kubernetes cara meningkatkan kluster untuk mengelola data dan mengatur pemantauan untuk secara proaktif melacak kesehatan cluster dan aplikasi yang dikerahkannya membuat monitor dan mengelola kelompok kain layanan. mengelola dan memelihara kumpulan dan wadah yang di-hosting biru dengan cara yang lebih baik. menyebarkan aplikasi kemas ke salah satu solusi wadah klaster yang tersedia menggunakan pipeline pengiriman berkelanjutan. mengelola kluster ini dalam skenario produksi.", "type": "cp"},
	{"kalimat": "memahami berbagai jenis pengujian dan skenario penggunaan berdasarkan pengembangan uji coba dan itu manfaat u0026rsquo bagaimana membuat dan mengimplementasikan tes unit dan elemen dari tes yang baik u0026nbsp cara membuat tes api dasar atau pengujian integrasi pengujian kinerja dan cara membuat tes kinerja menggunakan visual studio dan layanan tim studio visual vsts bagaimana menganalisis hasil tes kinerja menggunakan wawasan aplikasi pengujian eksplorasi dalam konteks visual studio dan microsoft test manager", "type": "cp"},
	{"kalimat": "memahami praktik pemantauan aplikasi dan praktik dan prinsip loop umpan balik umum. berbagai jenis umpan balik dan bagaimana mereka digunakan dalam berbagai tahap aliran nilai dan manfaatnya. cara mengatur pemantauan dengan wawasan aplikasi biru memantau u0026nbsp pencarian ketersediaan aplikasi web dan menganalisis data pemantauan dalam wawasan aplikasi tentang cara menggunakan dan meminta data wawasan aplikasi dan peta aplikasi cara mengatur u0026nbsp mengkonfigurasi query dan menganalisis pengumpulan data pada unit manajemen operasi oms log analytics cara mengatur pemberitahuan di oms dan mengintegrasikan wawasan aplikasi u0026nbsp mengkonfigurasi dan memonitor aplikasi web dengan konfigurasi relik baru dan menggunakan loggly", "type": "cp"},
	{"kalimat": "cara mendaftar dan u0026nbsp memulai dengan pusat aplikasi studio visual vsac cara menyambung ke repositori dan membangun aplikasi di vsac cara menguji aplikasi menggunakan vsac cara membuat dan menyebarkan aplikasi menggunakan vsac", "type": "cp"},
	{"kalimat": "sifat dasar dan maksud dari mata uang desentralisasi terpusat dan pemahaman mendalam tentang bitcoin dari bawah ke atas termasuk pencatatan transaksi identitas dan konsensus. akar bitcoin dalam gerakan cypherpunk dan cita-cita libertarian dan signifikansi revolusioner dari bitcoin yang bertentangan dengan beberapa pendahulunya terdahulu. mekanisme di balik bitcoin seperti kriptografi jaringan bitcoin dan fungsi hash kriptografi, skrip bitcoin, dan skema komitmen hash. aspek dunia nyata dari bitcoin seperti dompet dompet transaksi pertambangan mekanika dan tata kelola bitcoin dan berbagai cara seseorang dapat berinteraksi dengan jaringan bitcoin. cara menghancurkan bitcoin termasuk berbagai serangan jaringan. u0026nbsp properti di balik platform blockchain ethereum terbesar kedua termasuk mesin virtual ethereum dan gagasan kelengkapan turing perbedaan protokol utama antara bitcoin dan ethereum pada kasus penggunaan ethereum.", "type": "cp"},
	{"kalimat": "pelajari cara kerja analitik web dan cara menganalisis data analisis memahami cara mengembangkan pengujian b sebelum dan setelah itu eksperimen multivarianle mempelajari cara menyiapkan dan menganalisis studi pengujian tidak dimoderasi jarak jauhalisis dan laporkan pada studi pengalaman pengguna skala besar", "type": "cp"},
	{"kalimat": "dasar-dasar matematika untuk mempelajari sirkuit dan teknik untuk menganalisis sirkuit dengan skala apa pun dan berisi setiap elemen n aplikasi dunia tunggangan dari sirkuit dan konsep yang terkait dengan kursus eecs, mis. sinyal dan sistem elektronik, dll. nsektor yang dibutuhkan untuk teknisi yang memenuhi syarat mis. persamaan teknik dan abstraksi n", "type": "cp"},
	{"kalimat": "pengetahuan dasar tentang algoritma dan pemrograman java mengembangkan program dengan conditional dan loopsdesign dan mengimplementasikan algoritma rekursifmendapatkan mekanisme dasar dari paradigma oop dan menafsirkan api dari beberapa kelas java yang paling umummengembangkan program sederhana di java", "type": "cp"},
	{"kalimat": "Tujuan dari kursus ini adalah untuk memulai dengan python sebagai bahasa pemrograman dan memberi Anda rasa bagaimana mulai bekerja dengan data dalam python.in kursus ini Anda akan belajar tentang apa itu python dan mengapa itu berguna aplikasi python u0026nbsp cara menetapkan variabel u0026nbsp menetapkan u0026nbsp dan u0026nbsp pernyataan kondisional u0026nbsp dalam python tujuan memiliki fungsi u0026nbsp u0026nbsp dalam python cara mengoperasikan file untuk u0026nbsp membaca dan menulis data u0026nbsp dalam python bagaimana menggunakan u0026nbsp pandas harus memiliki paket u0026nbsp u0026nbsp untuk siapa pun yang mencoba analisis data dengan python.", "type": "cp"},
	{"kalimat": "diawasi vs pembelajaran mesin tanpa pengawasan bagaimana pemodelan statistik berhubungan dengan pembelajaran mesin dan u0026nbsp bagaimana melakukan perbandingan masing-masing. cara berbeda mesin u0026nbsp belajar u0026nbsp mempengaruhi masyarakat u0026nbsp", "type": "cp"},
	{"kalimat": "membuat aplikasi chatbot yang berinteraksi dalam bahasa alami di ibm cloud mencerna data yang dapat diminta untuk mengekstrak entitas konsep sentimen dan taksonomi dengan menggunakan penemuan watson mengungkapkan sentimen emosi dan preferensi pelanggan yang ditemukan di ulasan hotel dengan menggunakan analisa nada dan wawasan kepribadian dan umpan yang data ke chatbot", "type": "cp"},
	{"kalimat": "Anda akan belajar tentang aplikasi pembelajaran mendalam yang menarik dan mengapa itu benar-benar bermanfaat untuk belajar bagaimana memanfaatkan keterampilan belajar yang mendalam. Anda akan belajar tentang jaringan saraf dan bagaimana mereka belajar dan memperbarui bobot dan bias mereka. Anda akan belajar tentang masalah gradien menghilang u0026nbsp. Anda akan belajar tentang membangun model regresi menggunakan perpustakaan keras. Anda akan belajar tentang membangun model klasifikasi menggunakan perpustakaan keras. Anda akan belajar tentang model pembelajaran mendalam yang diawasi seperti jaringan saraf convolutional dan jaringan saraf berulang dan bagaimana membangun jaringan saraf convolutional menggunakan perpustakaan keras. Anda akan belajar tentang model pembelajaran yang tidak diawasi seperti autoencoders.", "type": "cp"},
	{"kalimat": "pemilihan dasar properti css n tfundamental css selectors n mendesain tata letak halaman melalui pemosisian relatif dengan praktik-praktik css n tbest dalam desain web n", "type": "cp"},
	{"kalimat": "cara menggunakan javascript untuk meningkatkan aplikasi dan membuat aplikasi yang lebih canggih dengan menambahkan hubungan antara model proses penerapan aplikasi ke pengguna nyata termasuk cara memantau identifikasi kinerja dan memperbaiki masalah kinerja umum dan menghindari mengorbankan data pelanggan bagaimana menerapkan teknik tangkas untuk meningkatkan dan meregor kode warisan", "type": "cp"},
	{"kalimat": "berbagai jenis pemrograman dan keahlian yang diperlukan untuk perancang gim video dan proses umum dari pemrograman u00a0 n thow struktur kontrol yang berbeda bekerja dan aset membuat jalan mereka ke video game dan bagaimana mereka berinteraksi dengan kode n", "type": "cp"},
	{"kalimat": "ikhtisar dari semua blok bangunan dari komputer kuantum dari qubit dan elektronik sepanjang jalan hingga perangkat lunak. prinsip ilmiah di balik komputer kuantum yang memungkinkan teknologi kuantum. bagaimana qubit dapat digunakan dan dikontrol secara efisien dan cara kerja dari empat jenis qubit solid state yang paling menjanjikan superkonduktor transmon qubit silicon spin qubit intan nv pusat qubit dan topological qubit.", "type": "cp"},
	{"kalimat": "Pada akhir kursus ini Anda akan dapat mengidentifikasi kompetensi pribadi dan kinerja untuk manajemen proyek dan membangun rencana untuk mengembangkan kompetensi manajemen proyek yang diperlukan dan tanalyze bagaimana dinamika dan budaya tim dapat mempengaruhi proyek dan manajemen perubahan organisasi untuk layanan pelanggan dan kesiapan pengiriman dan memahami strategi untuk mengelola proyek tim terdistribusi n", "type": "cp"},
	{"kalimat": "membuat aplikasi node merah mengkonsumsi layanan web dari node merah mengintegrasikan watson assistant dengan layanan watson lainnya menghubungkan aplikasi merah node Anda ke layanan eksternal seperti twitter menyebarkan chatbots Anda ke facebook messenger", "type": "cp"},
	{"kalimat": "pengetahuan kerja yang baik dari linux n thow untuk menavigasi melalui distribusi linux utama konfigurasi n tsystem dan antarmuka grafis dari linux n tbasic operasi baris perintah ntcommon aplikasi linux n", "type": "cp"},
	{"kalimat": "memahami konsep grafis 3d n twrite dan mengembangkan program-program yang membuat gambar dari adegan 3d dengan pencahayaan dan memahami dasar-dasar pemrograman grafis dengan opengl dan glsl n u00a0", "type": "cp"},
	{"kalimat": "pelajari tentang berbagai jenis dan kegunaan survai dalam penelitian uxuntuk mengetahui populasi survei kapan harus mengambil sampel saat merekrut instrumen survei yang memenuhi persyaratan Anda menganalisis dan melaporkan survei, termasuk survei pengguna kritik", "type": "cp"},
	{"kalimat": "mengembangkan aplikasi vr profesional menggunakan kesatuan 3d menjalankan aplikasi 3d kesatuan di vr pada smartphone membuat lingkungan 3d dari awal dalam mesin permainan memilih dan memanipulasi objek dengan berbagai jenis input bergerak di sekitar dunia 3d menggunakan metode penggerak unik membuat menu 3d intuitif untuk mengontrol desain aplikasi metode unik dari input interaksi 3d informasi alfanumerik seperti teks dan angka di vr membangun alat untuk membantu pengguna menavigasi lingkungan 3d belajar tujuan kegunaan kunci dan jebakan untuk virtual reality", "type": "cp"},
	{"kalimat": "perangkat lunak didefinisikan dan lanskap jaringan open source bagaimana perangkat keras jaringan sedang terpilah membuka sistem operasi jaringan nos dan bagaimana mereka berjalan di berbagai cara perangkat keras jaringan untuk mengotomatisasi tugas-tugas jaringan bagaimana perangkat lunak didefinisikan jaringan pengontrol sdn mengelola jaringan bawah jaringan fungsi virtualisasi dan bagaimana hal itu dapat membantu mengurangi Kompleksitas alat-alat orkestrasi lingkungan pusat data sekarang ini yang dapat membangun jembatan antara aplikasi dan jaringan", "type": "cp"},
	{"kalimat": "dasar-dasar komputasi awan n tcharacteristics teknologi cloud yang berbeda n twipping pengetahuan tentang bagaimana memilih tumpukan teknologi yang tepat untuk kebutuhan Anda n", "type": "cp"},
	{"kalimat": "apa dampak blockchain isblockchain dan potensi perubahan di seluruh dunia memahami bagaimana blockchain diterapkan untuk semua aspek bisnis u0026nbsp mendemonstrasikan beberapa kasus penggunaan blockchain langsung dalam bisnis teknologi dan produk dan institusi perusahaan", "type": "cp"},
	{"kalimat": "hubungan antara matriks transformasi linier dan sistem persamaan linier matriks terpartisi dan karakteristik dari matriks matriks khusus untuk perhitungan matriks dan sistem penyelesaian persamaan ruang vektor subruang dan penokohan linear orthogonalitas independen kuadrat terkecil linear nilai eigen dan vektor eigen", "type": "cp"},
	{"kalimat": "python 3 pemrograman dasar-dasar alat python ulasan mis. modul numpy dan scipy untuk aplikasi penelitian bagaimana menerapkan alat penelitian python dalam pengaturan praktis", "type": "cp"},
	{"kalimat": "Pada akhir kursus ini Anda akan dapat menjelaskan apa itu pmo dan mengapa itu ada dan mendeskripsikan bagaimana sebuah pmo bekerja dalam organisasi yang lebih luas n mengidentifikasi dan menggambarkan strategi tingkat tinggi untuk mengatur mempertahankan dan menghentikan seorang pmo memahami teknik untuk memprioritaskan asupan dan memilih proyek dan program sehingga mereka sejajar dengan organisasi keseluruhan strategi bisnis n", "type": "cp"},
	{"kalimat": "mempelajari bahasa pemrograman rubi dan ruby ​​pada rel framework MVC mengembangkan perangkat lunak sebagai layanan saas menggunakan ruby ​​pada rel dan teknik lincah memahami dan menerapkan teknik pemrograman dasar untuk pengujian pengembangan desain dan penyebaran cloud publik dari aplikasi saas bagaimana fitur bahasa pemrograman modern dapat meningkatkan produktivitas dan pemeliharaan kode", "type": "cp"},
	{"kalimat": "pada akhir kursus ini Anda akan dapat memahami banyak peluang peluang karir cybersecurity dan menyelesaikan keterampilan pemecahan masalah menuju evaluasi diri terhadap kompatibilitas dengan jalur karier dan menjelajah eksplorasi Anda ke jalur kerja yang paling kompatibel dalam keterampilan keamanan cybersecurity n tassess dan kemampuan dalam kaitannya dengan persyaratan spesifik dan muncul untuk jalur-jalur tersebut dan menemukan pelatihan dan langkah-langkah selanjutnya yang diperlukan untuk memenuhi persyaratan dan memenuhi tujuan dalam jalur keamanan dunia maya n", "type": "cp"},
	{"kalimat": "pada akhir kursus ini Anda akan dapat mengidentifikasi alat dan keterampilan apa yang diperlukan untuk membentuk alat-alat keamanan dunia maya saat ini dan alat-alat yang tepat untuk tujuan yang berbeda dalam proses manajemen keamanan cyber dan wawasan yang disintesis yang diperoleh dalam penjelajahan program keahlian toolkit yang bekerja. terhadap evaluasi diri terhadap bakat dan minat yang selaras dengan peran cybersecurity u2019s dari peran n", "type": "cp"},
	{"kalimat": "pada akhir kursus ini Anda akan dapat mengidentifikasi empat domain cybersecurity dan perbedaan antara peraturan peraturan mereka dan hasil yang diinginkan n menjelaskan peran ciso di semua domain dan perbedaan antara peran ciso di antara domain n tidentify cybersecurity alat khusus untuk domain dan situasi yang sesuai. n", "type": "cp"},
	{"kalimat": "pada akhir kursus ini Anda akan dapat mendefinisikan dan menggunakan istilah-istilah dan konsep-konsep kunci di bidang cybersecurity n tidentify dan membedakan aktor-aktor ancaman dan motivasi mereka nmenghubungkan jenis-jenis kontrol yang sesuai dengan tindakan-tindakan para pelaku ancaman yang berbeda n menggambarkan perbedaan-perbedaan dan interaksi di antara lembaga internasional yang terkait dengan cybersecurity menggambarkan setidaknya dua tantangan hukum potensial terhadap cybersecurity di negara Anda. n", "type": "cp"},
	{"kalimat": "peran yang berbeda pada tim pengembangan video game peran yang berbeda pada bisnis yang lebih luas dan mendukung tim desainer game latar belakang u0026rsquo dan bagaimana mereka berinteraksi satu sama lain proses dimana video game dibuat dipasarkan dan dijual", "type": "cp"},
	{"kalimat": "bagaimana alat matematika seperti persamaan diferensial fase analisis plane memisahkan skala waktu dan proses stokastik dapat digunakan untuk memahami dinamika neuron dan kode neural n", "type": "cp"},
	{"kalimat": "memahami berbagai jenis kebutuhan pengguna dan pertentangan mereka untuk melakukan wawancara pengguna yang efektif, mengembangkan persona dan skenario saat alat desain menggunakan informasi publik, mis. internet untuk memajukan pemahaman Anda tentang kebutuhan pengguna meninjau teknik tambahan untuk mengungkap kebutuhan pengguna", "type": "cp"},
	{"kalimat": "bagaimana sumber daya komputasi mempengaruhi server sql jenis penyimpanan apa yang tersedia untuk sistem database Anda bagaimana jaringan mempengaruhi konektivitas basis data bagaimana keamanan diimplementasikan dalam server sql", "type": "cp"},
	{"kalimat": "cara menulis pagfonept web dari bahasa markup dari desain html5 dan cssweb dan tata letak gaya halaman dan flexbox", "type": "cp"},
	{"kalimat": "melalui kuliah dan tangan pada proyek kursus mengeksplorasi prinsip-prinsip suara grafis 2D dan 3d animasi dan deteksi tabrakan menggunakan kerangka seperti kesatuan dan l0026ouml ve 2d serta bahasa seperti lua dan c. oleh kelas u0026rsquo s end u0026nbsp Anda u0027ll u0026nbsp telah memprogram beberapa dari u0026nbsp permainan Anda sendiri dan memperoleh pemahaman menyeluruh tentang dasar-dasar desain dan pengembangan game.", "type": "cp"},
	{"kalimat": "javascript es6 bereaksi komponen jsx alat peraga komponen gaya keadaan dilihat input pengguna debugging data navigasi expo komponen redux pengujian kinerja pengiriman", "type": "cp"},
	{"kalimat": "git html css flask sql apis javascript ujung depan django testing ci cd skalabilitas keamanan", "type": "cp"},
	{"kalimat": "Pada akhir kursus ini Anda akan dapat menjelaskan mengapa organisasi menggunakan manajemen proyek untuk memberikan nilai bisnis dan menggambarkan hubungan antara program-program proyek dan portofolio dan mendefinisikan perbedaan antara siklus hidup berbasis iteratif dan tangkas yang prediktif n tanalyze peran manajemen proyek yang berbeda u2014 proyek manajer mensponsori pemilik dan pengembang produk scrummaster stakeholder t mengerti bagaimana budaya organisasi dapat mempengaruhi peran manajer proyek n", "type": "cp"},
	{"kalimat": "dapat mendeskripsikan konsep dasar dan algoritma yang diperlukan untuk mobile robot locomotion environment perception probabilistic map berdasarkan lokalisasi dan pemetaan dan perencanaan gerak n dapat menerapkan konsep-konsep ini untuk desain dan implementasi robot bergerak otonom yang bertindak dalam lingkungan yang kompleks.", "type": "cp"},
	{"kalimat": "bagaimana menjalankan prototif kertas testexpand pada wireframe dengan mengembangkan interferensi mockupsdevelop high fidelity untuk menguji lebih lanjut pengalaman pengguna membuat dokumen spesifikasi desain", "type": "cp"},
	{"kalimat": "memahami berbagai tahapan revolusi industri memahami masa depan kerja dan keterampilan yang dibutuhkan driver enabler dan kekuatan yang mendorong untuk industri 4.0 u0026rsquo s kemajuan pabrik pintar dan bagaimana u0026nbsp mereka dibandingkan dengan yang sudah ada mengerti apa u0026nbsp internet hal iot dan industri internet hal iiot analisis prediktif big data yang mengarah ke keputusan yang didorong data dan otomatisasi sistem fisik maya dan sistem utama lainnya dalam industri 4.0 memahami peran dan pentingnya data dan komputasi awan cara menggunakan cloud untuk mendukung upaya kolaboratif mesin manusia penggunaan contoh robot kolaboratif dari produk dan layanan otomatisasi cerdas tantangan dalam cybersecurity dan bagaimana mengurangi mereka bagaimana organisasi dan pekerja pengetahuan dapat lebih baik mempersiapkan untuk industri 4.0", "type": "cp"},
	{"kalimat": "bagaimana menjelaskan dan kontras teknik yang berbeda untuk pemetaan visualisasi dan pemodelan sel tunggal bidang sinaptik sirkuit yang lebih besar dari neuron dan interaksi jarak jauh antara daerah kortikal cara-cara untuk mengklasifikasikan neuron dan menghubungkan morfologi sel untuk berfungsi bagaimana menggunakan atlas otak dan alat pemodelan", "type": "cp"},
	{"kalimat": "apa chatbots dan mengapa mereka revolusioner apa yang watson u0026nbsp asisten dan bagaimana Anda dapat memanfaatkan kemampuan u0026nbsp ai prinsip-prinsip utama dari desain chatbot yang baik cara membuat chatbot Anda sendiri tanpa u0026nbsp kebutuhan untuk menulis kode bagaimana cara menyebarkan chatbot Anda di wordpress situs cara mendaftar sebagai mitra ibm jika Anda berniat membangun chatbots untuk pelanggan cara membuat uang u0026nbsp dengan chatbots.", "type": "cp"},
	{"kalimat": "mempelajari tag HTML5 baru yang disederhanakan, bermain dengan tag audio dan video, menggambar dan menganimasikan grafis web yang menyenangkan menemukan fitur bentuk html5 terbaru menguji apis dasar seperti penyimpanan web dan geolokasi dan sebagian besar dari semua teknik pengkodean praktik berkat beberapa contoh interaktif", "type": "cp"},
	{"kalimat": "bagaimana menggunakan layanan kontainer aws bagaimana meningkatkan kinerja aplikasi melalui teknik seperti caching bagaimana mengoptimalkan aplikasi Anda dengan menggunakan teknologi serverless dan autoscaling. bagaimana menggunakan distribusi konten untuk meningkatkan pengalaman pengguna akhir bagaimana menggunakan antarmuka baris perintah aws cli bagaimana mengenkripsi data saat istirahat dan transit menggunakan layanan manajemen kunci aws", "type": "cp"},
	{"kalimat": "sifat dasar bilangan prima aritmatika modular dan fermat u0027s undang-undang teorema kecil dari aplikasi bilangan prima bilangan prima untuk masalah terbuka kriptografi dan kemajuan terbaru", "type": "cp"},
	{"kalimat": "bagaimana membuat data menjadi hidup dengan jenis visualisasi yang terkenal seperti grafik garis dan batang dan jenis-jenis baru visualisasi seperti garis percikan plot kontur dan piramida populasi. n thow untuk membuat dasbor di excel berdasarkan data langsung yang dapat memenuhi kebutuhan manajerial dan bisnis. n thow untuk menghubungkan data dari berbagai sumber seperti web dan ekspor dari getah Anda atau getah data. n tangan tsome pada ilmu data dan bagaimana menggunakan alat analisis yang dapat ditindaklanjuti. n tdeep menyelam ke dalam alat yang dikenal seperti pivot dan memperkenalkan yang baru seperti toolpak analisis. n", "type": "cp"},
	{"kalimat": "pemahaman sistem tertanam menggunakan desain modular dan abstraksi n tc pemrograman mempertimbangkan baik fungsi dan gaya n tbuild dan rangkaian tes dengan switch leds resistor potensiometer dan menampilkan kristal cair n mensinkronkan input perangkat keras dan perangkat lunak output dengan switch lampu sensor suara. motor dan liquid crystal display u00a0 n tlearn cara menyelesaikan masalah menggunakan mesin negara yang terbatas n tdebug menggunakan oscilloscopes logic analyzers dan instrumentasi perangkat lunak n tlearn cara membaca lembar data n tconstruct traffic light controller n", "type": "cp"},
	{"kalimat": "pemahaman sistem tertanam menggunakan desain modular dan abstraksi n tc pemrograman mempertimbangkan baik fungsi dan gaya n tbuild dan rangkaian tes dengan switch leds resistor potensiometer dan menampilkan kristal cair n mensinkronkan input perangkat keras dan perangkat lunak output dengan switch lampu sensor suara. motor dan liquid crystal menampilkan n timplement sebuah i o driver dan multi threaded programming menggunakan interupsi n tdebug menggunakan oscilloscopes logic analyzers dan instrumentasi perangkat lunak n belajar cara membaca lembar data nmenghubungkan objek yang pintar dan membuat sistem sebagai bagian dari internet dari hal-hal n", "type": "cp"},
	{"kalimat": "mempelajari dasar-dasar sistem yang tertanam dan memahami bagaimana membangun sistem operasi real time Anda sendiri dan bagaimana merancang dan mengembangkan kode dan mempelajari desain modular sambil menciptakan perangkat kebugaran pribadi dan belajar tentang komunikasi bluetooth", "type": "cp"},
	{"kalimat": "cara menginstal mongodb cara menggunakan kompas mongodb gui model dokumen mongodb dan skema dasar desain bahasa query mongodb cara menggunakan atlas mongodb u0027s host database sebagai layanan yang menawarkan", "type": "cp"},
	{"kalimat": "belajar untuk menghasilkan sketsa awal yang menangkap proses ideasi membuat cerita pengguna dan storyboard untuk mendukung konsepmengembangkan antarmuka wireframes untuk memberikan tes yang menarik contohmenggunakan teknik analisis komparatifdari desain walkthrough untuk menguji konsep", "type": "cp"},
	{"kalimat": "pemrograman berorientasi objek metode tangkas dan prototyping manajemen konfigurasi perangkat lunak bahasa pemodelan terpadu uml manajemen proyek dan pola organisasi untuk fase yang berbeda dari proyek perangkat lunak", "type": "cp"},
	{"kalimat": "mendapatkan apresiasi yang mendalam dari iot n tunderstand apa yang merupakan solusi desain iot n tstart untuk menumbuhkan benih-benih iot ide dalam bidang Anda dan bidang keahlian n", "type": "cp"},
	{"kalimat": "bagaimana menggunakan perangkat pengembang aws termasuk aws elastic beanstalk aws cloudformation aws codebuild aws codedeploy dan aws codepipeline. bagaimana menggunakan perangkat aws untuk memantau lingkungan pengembangan dan produksi Anda. bagaimana memonitor kinerja aplikasi menggunakan alat-alat aws termasuk amazon cloudwatch dan amazon elasticsearch bagaimana mengotomatiskan proses produksi staging development", "type": "cp"},
	{"kalimat": "cloud computing karena membandingkan dengan virtualisasi penyebaran server virtual cara menginstal openstack dengan alat-alat manajemen baris perintah alat otomatis skala scaling out openstack cloud", "type": "cp"},
	{"kalimat": "cara mengatur dan mengakses kernel cluster menggunakan cara minicube untuk menjalankan aplikasi di lingkungan kubernets yang dikerahkan dan mengakses utilitas aplikasi yang dikerahkan untuk kepentingan komunitas komunitas dan bagaimana Anda dapat berpartisipasi.", "type": "cp"},
	{"kalimat": "dasar-dasar nfv masalah diselesaikan oleh opnfv u0026nbsp gambaran dari proyek-proyek hulu yang terintegrasi oleh opnfv cara kerja berbagai proyek opnfv opnfv menggunakan kasus dan bagaimana terlibat dalam opnfv", "type": "cp"},
	{"kalimat": "dasar-dasar nfv konsep arsitektur baru yang diperkenalkan oleh onap onap arsitektur onap subproyek onap demo resmi bagaimana cara terlibat", "type": "cp"},
	{"kalimat": "pendekatan yang berbeda untuk pengujian kegunaan dan penggunaannya yang tepat n thow untuk merancang tes kegunaan yang efektif n thow untuk menjalankan tes kegunaan yang efektif untuk mendapatkan informasi yang paling mungkin keluar dari setiap pertemuan n tanalyze dan melaporkan pengujian kegunaan n", "type": "cp"},
	{"kalimat": "cara membuat dan mengelola konsep aws account aws fundamental termasuk zona ketersediaan wilayah dan virtual private clouds vpcs cara menginstal dan menggunakan aws sdks cara menggunakan layanan komputasi aws baik melalui konsol aws dan secara terprogram cara menggunakan layanan yang dikelola aws seperti amazon rds bagaimana menggunakan gambar amazon ai dan aplikasi text to speech bagaimana membuat aplikasi Anda lebih tahan lama didistribusikan dan sangat tersedia", "type": "cp"},
	{"kalimat": "jenis perangkat virtual reality dan kekuatan dan kelemahan mereka bagaimana aplikasi virtual reality berbeda dari program perangkat lunak interaktif lainnya yang membuat aplikasi realitas virtual berhasil apa yang harus dihindari saat menulis perangkat lunak virtual reality pemrograman vr dasar menggunakan webvr", "type": "cp"},
	{"kalimat": "siapa yang memiliki data dan kami menghargai aspek-aspek privasi yang berbeda dan kami mendapatkan informed consent bahwa itu berarti adil", "type": "cp"},
	{"kalimat": "bagaimana cara memproduksi dan merekam teori sejarah musik Anda sendiri dan praktik teknologi musik suara audio efek midi dan tangan sequencing pada praktek dengan pembuatan musik menggunakan alat digital kontemporer", "type": "cp"},
	{"kalimat": "dalam kursus ini Anda akan mempelajari dasar-dasar presentasi paket-paket kantor presentasi spreadsheet pengolah kata dan manajer basis data aspek-aspek teknis dasar dari sistem e-mail dan konferensi. operasi sistem operasi dasar dari web browser dan teknologi internet deskripsi dasar dari berbagai aplikasi bisnis intelijen bisnis erp crm gis scm dms edi ....", "type": "cp"},
	{"kalimat": "menjelaskan kebutuhan untuk melakukan devops. pahami prinsip-prinsip dan praktik-praktik dasar-dasar devop. n tunderstand menganalisa dan memetakan aliran nilai. n texplain dan implementasikan pipeline penyebaran. n mengedepankan konsep pengiriman berkelanjutan. nmembuat budaya pemecahan masalah. tjelaskan konsep postmortem yang tidak bercacat. n pemantau infrastruktur dan metrik bisnis yang berarti. t konverver perubahan manajemen dan devops. ∎ pahami bagaimana ketahanan budaya dan budaya keselamatan sangat penting untuk mencapai sukses. nmembuat organisasi pembelajaran. u00a0 n", "type": "cp"},
	{"kalimat": "Algoritma di balik struktur data fundamental array dinamis struktur terkait dan pohon yang tidak seimbang mencoba algoritma grafik tabel hash fungsi bagaimana alasan tentang struktur data yang tepat untuk memecahkan masalah termasuk kekuatan dan kelemahan mereka bagaimana menganalisis algoritma secara teoritis kasus kasus rata-rata terburuk dan diamortisasi perbedaan kunci dan hubungan antara u0022abstract tipe data u0022 dan u0022data struktur u0022 teori informasi dasar dan kompresi data yang memanfaatkan struktur data tertutup", "type": "cp"},
	{"kalimat": "mengidentifikasi fitur utama dari perilaku manusia dan menjelaskan dampaknya pada desain sistem interaktif ntikritik dan desain sistem interaktif berdasarkan pada kemampuan dan perilaku manusia n mendeskripsikan tema dari ilmu sosial dan interaksi komputer manusia dan bagaimana mereka berhubungan dengan desain sistem interaktif dan pembelajaran daftar periksa dan metode analisis formal n", "type": "cp"},
	{"kalimat": "keterampilan pemrograman dasar untuk menulis c ++ program untuk memecahkan masalah komputasi dunia nyata. praktek pemrograman yang baik bagaimana menangani program besar dan kompleks.", "type": "cp"},
	{"kalimat": "berbagai struktur data bagaimana mengatur data secara efisien bagaimana menggunakan struktur data yang tepat untuk mewakili mengatur dan memanipulasi data cara membuat struktur data menggunakan pemrograman dasar", "type": "cp"},
	{"kalimat": "cara abstrak masalah dalam objek berorientasi gaya berorientasi objek pemrograman dasar ke tingkat lanjutan menggunakan c + + cara menggunakan stl template template standar", "type": "cp"},
	{"kalimat": "struktur data kompleks bagaimana mengimplementasikan struktur data menggunakan paradigma berorientasi objek bagaimana memetakan tipe data abstrak ke pustaka template standar c ++.", "type": "cp"},
	{"kalimat": "struktur algoritma penting. bagaimana menggunakan algoritma dengan struktur data yang tepat untuk memecahkan masalah kehidupan nyata. bagaimana algoritma dan struktur data dapat digunakan untuk merancang sistem dalam skala besar.", "type": "cp"},
	{"kalimat": "kunci ide tangkas lincah prinsip-prinsip peran praktek dan artefak pro dan kontra dari metode tangkas paling populer bagaimana mendapatkan keuntungan dari metode tangkas secara umum", "type": "cp"},
	{"kalimat": "komputasi bahasa pemrograman internet teknologi web pengembangan teknologi tumpukan cloud computing", "type": "cp"},
	{"kalimat": "bagaimana mengembangkan algoritma untuk analisis statistik pengetahuan big data aplikasi big data bagaimana menggunakan prinsip-prinsip dasar yang digunakan dalam analisis prediktif mengevaluasi dan menerapkan teknik dan teori prinsip yang tepat untuk masalah sains data skala besar.", "type": "cp"},
	{"kalimat": "proyek batu penjuru data besar akan memberi Anda kesempatan untuk mendemonstrasikan secara praktis apa yang telah Anda pelajari dalam program mikromasters big data termasuk cara mengevaluasi memilih dan menerapkan prinsip teknik sains data dan teori bagaimana merencanakan dan melaksanakan pekerjaan proyek secara mandiri menggunakan identifikasi inisiatif Anda sendiri kekhawatiran sosial dan etika di sekitar proyek Anda mengembangkan keterampilan komunikasi menggunakan teknologi kolaboratif online.", "type": "cp"},
	{"kalimat": "belajar bagaimana merancang dan melaksanakan pengalaman penelitian dan proyek desain multi fase terpadu yang terintegrasi pengalaman pengalaman melakukan riset pengalaman pengguna di dunia nyata menetapkan pengalaman dengan proyek desain ux realistis yang substansialmemperlukan kemampuan untuk mengkomunikasikan konsep desain dan hasil riset yang dapat ditindaklanjuti", "type": "cp"},
	{"kalimat": "pengetahuan dan aplikasi mapreduceunderstanding tingkat kejadian peristiwa di datahow besar untuk merancang algoritma untuk pengolahan aliran dan penghitungan elemen sering dalam big dataunderstand dan algoritma pagerank desainmendapatkan algoritma berjalan acak yang mendasari", "type": "cp"},
	{"kalimat": "memahami dan menerapkan konsep-konsep pemikiran komputasional tingkat lanjut untuk data berskala besar yang menggunakan perangkat tingkat industri untuk persiapan data dan visualisasi seperti r dan metode javaapply untuk persiapan data ke set data besar teknik matematika dan statistik untuk menarik informasi dari set data besar dan menyinari hubungan antar data. set", "type": "cp"},
	{"kalimat": "sifat inovasi yang mengganggu teknologi cerdas dalam sistem infrastruktur perkotaan nstate strategi seni yang dapat digunakan untuk solusi infrastruktur u201csmart di perkotaan sambil mengelola transisi dari infrastruktur warisan ke sistem pintar secara efektif dari fase transisi dari sistem infrastruktur warisan ke kota pintar dengan mendukung inovasi sambil menghindari kunci awal dalam n tapplikasi untuk materi yang dipelajari dalam kursus ini dalam konteks pengelolaan sistem transportasi perkotaan u201csmart u201d serta sistem energi perkotaan u201csmart u201d n", "type": "cp"},
	{"kalimat": "bagaimana mengidentifikasi kesamaan dalam definisi data dan fungsi yang memungkinkan untuk menghindari pengulangan menggunakan abstraksi untuk mendesain fungsi yang beroperasi pada grafik sehingga merancang program yang mencari ruang masalah yang diberikan untuk menemukan solusi yang valid", "type": "cp"},
	{"kalimat": "bagaimana merancang dan menganalisa sirkuit menggunakan metode node superposisi dan metode thevenin n thow untuk menggunakan model sirkuit terpotong dan abstraksi untuk menyederhanakan analisis rangkaian n thow untuk menggunakan intuisi untuk memecahkan sirkuit nkonstruksi gerbang digital sederhana menggunakan transistor mosfet dan pengukuran variabel rangkaian menggunakan alat seperti virtual oscilloscopes virtual multimeters dan virtual signal generator n", "type": "cp"},
	{"kalimat": "bagaimana merepresentasikan informasi sebagai data yang memusatkan setiap bagian dari program Anda pada satu tugas yang menggunakan contoh dan tes untuk memperjelas apa yang program Anda harus lakukan untuk menyederhanakan struktur program Anda menggunakan pola umum yang mengenali dan mewakili informasi yang lebih rumit", "type": "cp"},
	{"kalimat": "cara memprogram cara mikrokontroler arduino untuk antarmuka arduino dengan sensor analog dan digital mendeteksi hal-hal seperti kebisingan ringan atau tekanan cara menggunakan pustaka perangkat lunak untuk mengontrol suara lampu motor dan aplikasi lebih dari konsep kunci u0026nbsp untuk membuat prototipe dari pembelajaran fablab dengan contoh prototyping cepat", "type": "cp"},
	{"kalimat": "loop n tnested loops n tarrays dan pengindeksan nttwo dimensi array n tarray indexing dan loop n trecursion n tcall stack n", "type": "cp"},
	{"kalimat": "Anda akan mendapatkan gambaran tentang pendekatan pemrograman yang ada dan belajar pada tingkat pengantar dua bahasa pemrograman visual dan alami statecharts dan live sequence charts.", "type": "cp"},
	{"kalimat": "model layanan cloud menghitung jaringan penyimpanan dan layanan tambahan di iaas tawaran yang khas iaas penyebaran arsitektur menyebarkan mengkonfigurasi dan memonitor situs web di aws", "type": "cp"},
	{"kalimat": "menggunakan pengecekan model untuk mengevaluasi kualitas perangkat lunak melalui pembuatan model dan menggunakan eksekusi simbolis untuk mengevaluasi perangkat lunak untuk kerusakan dan menggunakan metode formal untuk membuat bukti implementasi perangkat lunak n", "type": "cp"},
	{"kalimat": "menggambarkan jaringan 4g fungsi dan arsitektur u0026rsquo. menjelaskan bagaimana operator telekomunikasi menyediakan pengguna ponsel dengan alamat ip permanen dengan cara yang aman. menganalisis pertukaran internal dan protokol yang digunakan dalam pengalihan lokasi lampiran jaringan 4g. mengidentifikasi fungsi transportasi dan kontrol dalam jaringan 4g. mendiagnosis masalah layanan jaringan.", "type": "cp"},
	{"kalimat": "merencanakan dengan paket pylab n tstochastic programming dan statistik thinking n tmonte carlo simulations n", "type": "cp"},
	{"kalimat": "manfaat berpartisipasi dalam kompetisi pemrograman n tthe algoritma dan pendekatan yang Anda butuhkan untuk menguasai dunia kompetisi dan pelatihan diri untuk kemajuan lebih lanjut n", "type": "cp"},
	{"kalimat": "ciri antrian berdasarkan asumsi probabilistik tentang kedatangan dan jumlah waktu layanan ukuran buffer server dan disiplin layanan menggambarkan dasar-dasar waktu diskrit dan model rantai markov waktu kontinyu model sistem antrian sederhana misalnya mm 1 atau antrian mmcc sebagai rantai markov waktu kontinyu menghitung indikator kinerja utama seperti penundaan rata-rata tingkat pemanfaatan sumber daya atau probabilitas kerugian di server tunggal sederhana atau desain sistem multi server antrian simulasi dengan bahasa python untuk menganalisis bagaimana sistem dengan sumber daya terbatas mendistribusikan mereka di antara pelanggan", "type": "cp"},
	{"kalimat": "apa gamification dan bagaimana kaitannya dengan proses bisnis umum nbasic aksesibilitas digital dan bagaimana ia berinteraksi dengan gamification nhow untuk memperoleh pola desain permainan dari permainan digital populer n", "type": "cp"},
	{"kalimat": "perbedaan antara pengguna yang dapat beradaptasi dan adaptif antarmuka pendekatan umum untuk antarmuka pengguna personalisasi halaman web dan aplikasi web u0026nbsp fitur yang dapat diadaptasi untuk mendukung beragam kebutuhan terutama kebutuhan penyandang cacat. bagaimana mengembangkan atau mengadaptasi aplikasi web situs web sehingga menjadi mudah beradaptasi dan kepribadian kerangka kerja gpii infrastruktur inklusif global dan bagaimana ia mendukung personalisasi u0026nbsp", "type": "cp"},
	{"kalimat": "kerangka dan metodologi manajemen risiko keamanan informasi n mengidentifikasi dan memodelkan risiko keamanan informasi n tqualitative dan kuantitatif penilaian risiko metode n tarticulating risiko keamanan informasi sebagai konsekuensi bisnis n", "type": "cp"},
	{"kalimat": "bagaimana mengidentifikasi ketika serangan terjadi di dalam jaringan n thow untuk mengumpulkan bukti intrusi jaringan n thow untuk menguji jaringan dan sistem untuk kerentanan n thow untuk mempersiapkan dan bertahan terhadap serangan jaringan n", "type": "cp"},
	{"kalimat": "pemrograman di awal konsep pemrograman luas loop variabel struktur data didaktik pemrograman dalam pendidikan dan mengintegrasikan ini di kelas Anda sendiri", "type": "cp"},
	{"kalimat": "definisi formal dari konsensus terdistribusi dan topik mendasar seperti teorema cap dan masalah jenderal Bizantium. mekanisme konsensus alternatif untuk bukti kerja bitcoin u0026rsquo termasuk bukti voting berdasarkan voting algoritma dan konsensus federasi. arti dan sifat-sifat cryptoeconomics yang berkaitan dengan dua kriptografi dan ekonomi bidang komposisi serta tujuan untuk cryptoeconomics sehubungan dengan sistem terdistribusi fundamental berbagai implementasi blockchain tingkat perusahaan seperti jp morgan u0026rsquo s quorum ripple tendermint dan hyperledger termasuk industri gunakan case untuk blockchain icos dan peraturan yang meningkat seputar blockchain. tantangan dengan skala dan hambatan untuk adopsi blockchain secara luas serta solusi yang mungkin dalam skala vertikal u0026nbsp misalnya blocksize meningkatkan saksi terpisah dan jaringan petir dan skala horizontal, mis. sidechains sharding. langkah-langkah yang diambil pemerintah untuk mengatur dan mengontrol teknologi blockchain, mis. anti pencucian uang dan tahu peraturan pelanggan Anda anonimitas tujuan dan teknik pemerintah untuk deanonymization entitas di blockchain. sebuah pandangan eksplorasi ke dalam usaha-usaha blockchain hari ini seperti icos kapitalisme ventura dan crowdfunding. u0026nbsp", "type": "cp"},
	{"kalimat": "bagaimana menentukan masalah memecahnya menjadi langkah dasar mereka dan merancang algoritma dan abstraksi untuk menyelesaikannya bagaimana memilih paradigma pemrograman yang tepat dan menulis program dalam paradigma ini untuk memecahkan masalah bagaimana menggunakan semantik formal untuk berpikir tentang program yang benar bagaimana menulis program konkuren kecil dalam paradigma aliran data deterministik u0026nbsp", "type": "cp"},
	{"kalimat": "mendeskripsikan blockchain bisnis dan teknologi buku besar terdistribusibanyak keakraban dengan proyek hyperledger saat ini dan lintas industri u0026nbsp menggunakan casesperform instalasi bersih dari hyperledger composer hyperledger sawtooth dan u0026nbsp hyperledger fabric frameworkmengeksplor contoh use case application dalam konteks u0026nbsp hyperledger composer hyperledger indy hyperledger sawtooth dan hyperledger fabric u0026nbsp frameworksuntuk membuat aplikasi sederhana di atas hyperledger sawtooth dan u0026nbsp hyperledger fabricbecome yang terlibat dan berkontribusi pada proyek open source hyperledger", "type": "cp"},
	{"kalimat": "menjelajahi keamanan runtime dan jaringan pengecoran awan. n thow untuk membangun runtime dan dukungan kerangka dengan buildpacks. n tlearn u0022dua belas faktor aplikasi u0022 pola desain untuk ketahanan dan skalabilitas. dan ambil langkah-langkah yang diperlukan untuk membuat aplikasi Anda u0022cloud native u0022. ∎ pahami bagaimana masing-masing komponen pengecoran awan bergabung untuk menyediakan platform asli cloud. Teknik-teknik dan contoh-contoh tstudy untuk menemukan masalah dalam sistem terdistribusi. n", "type": "cp"},
	{"kalimat": "di mana video game pertama datang dari n video game thow terhubung ke pinball n twhy industri jatuh di 80 u2019s n twhen virtual reality vr pertama kali muncul di industri n thow permainan dari grafik masa lalu jalan menuju masa depan game n", "type": "cp"},
	{"kalimat": "cara untuk mengekspresikan masalah komputasi seperti mencari jejak menggunakan teori graph untuk memilih algoritma yang tepat untuk memecahkan masalah komputasi yang diberikan bagaimana mengode solusi algoritmik dalam metode python untuk mengevaluasi solusi yang diusulkan dalam hal jumlah kompleksitas skalabilitas sumber daya atau latency akurasi kinerja", "type": "cp"},
	{"kalimat": "menerapkan keterampilan administrator cloud yang Anda pelajari dalam program profesional microsoft. mengevaluasi proyek infrastruktur berskala besar dan mendokumentasikan solusi berbasis cloud yang di-hosting di microsoft biru. menjawab serangkaian pertanyaan berdasarkan skenario yang menunjukkan pemahaman Anda tentang tantangan teknis proyek infrastruktur cloud melakukan serangkaian tugas berbasis lab tempat Anda menerapkan dan mengelola infrastruktur cloud berdasarkan skenario yang diberikan. u0026nbsp", "type": "cp"},
	{"kalimat": "itu mendukung keterampilan agen proses pengetahuan keterampilan profesional keterampilan komunikasi pemecahan masalah interpersonal dan dokumentasi", "type": "cp"},
	{"kalimat": "menerapkan keterampilan data besar yang telah Anda pelajari dalam program profesional microsoft untuk data besar untuk membangun solusi data besar.", "type": "cp"},
	{"kalimat": "kursus ini tidak biasa karena merupakan ujian pengetahuan dan keterampilan yang telah Anda kembangkan dengan mengambil kursus lain. titik proyek batu penjuru ini adalah untuk memungkinkan untuk mendapatkan pengalaman menerapkan keterampilan ini untuk memecahkan masalah nyata.", "type": "cp"},
	{"kalimat": "proyek batu penjuru ini bukan tutorial melainkan proyek akhir yang dikembangkan oleh siswa berdasarkan spesifikasi yang disediakan di bagian konten.", "type": "cp"},
	{"kalimat": "menunjukkan keahlian desain Anda dengan meneliti masalah dan merancang solusi yang berfokus pada pengguna menunjukkan keterampilan pengkodean Anda dengan membangun solusi perangkat lunak dari desain Anda sendiri menunjukkan kemampuan desain kode profesional Anda dengan membuat basis kode yang terstruktur dengan baik dan dapat dipertahankan", "type": "cp"},
	{"kalimat": "tujuan pembelajaran mengotomatisasi infrastruktur menggunakan template lengan manajer sumber daya biru menerapkan solusi integrasi berkelanjutan menerapkan pengiriman berkelanjutan dan solusi penyebaran berkelanjutan dengan layanan tim studio visual yang menerapkan solusi pengujian seperti tes unit dan pengujian dalam aplikasi implementasi solusi pemantauan produksi menggunakan wawasan aplikasi", "type": "cp"},
	{"kalimat": "menjelaskan apa gpu adalah bagaimana hal itu dapat mempercepat perhitungan dan kelebihannya dibandingkan dengan CPU. mengimplementasikan jaringan pembelajaran dalam pada gpus. melatih dan menyebarkan jaringan pembelajaran dalam untuk klasifikasi gambar dan video serta untuk pengenalan objek.", "type": "cp"},
	{"kalimat": "mengatur data pada array dan daftar terkait menggunakan tipe dan kelas data primitif. nmengembangkan dan menggunakan struktur data linier seperti tumpukan dan antrean yang diterapkan dengan daftar atau larik yang ditautkan. mengembangkan dan menggunakan struktur data non-linear seperti pohon termasuk pohon pencarian biner dan tumpukan diimplementasikan dengan daftar atau larik yang ditautkan. n menerapkan algoritme untuk pencarian dan pemilahan data yang efisien. n", "type": "cp"},
	{"kalimat": "bagaimana menganalisis data dan melakukan visualisasi data sederhana menggunakan processingjsunderstand dan menerapkan konsep-konsep pengantar pemrograman seperti sequencing iteration dan selectionequip Anda untuk belajar ilmu komputer atau bahasa pemrograman lainnya", "type": "cp"},
	{"kalimat": "menentukan metode pembelajaran mendalam apa yang digunakan dalam situasi apa yang tahu bagaimana membangun model pembelajaran yang mendalam untuk memecahkan masalah yang nyata, menguasai proses pembuatan saluran pembelajaran mendalam, menerapkan pengetahuan tentang pembelajaran mendalam untuk meningkatkan model menggunakan data nyata yang menunjukkan kemampuan untuk menyajikan dan mengkomunikasikan hasil proyek pembelajaran mendalam", "type": "cp"},
	{"kalimat": "setelah menyelesaikan kursus Anda akan dapat memperoleh afem untuk pde umum dengan relevansi dalam industri persamaan stok navier untuk aliran mampat persamaan gelombang elastisitas linear dan kombinasi multi-fisika dari persamaan ini. memperoleh sifat dasar dari metode yang merupakan kunci untuk ketahanan dan efisiensi seperti stabilitas konservasi energi dan perkiraan kesalahan apriori dan posteriori. menerapkan algoritma femum umum seperti adaptifitas perakitan dan penyempitan mesh lokal dan memiliki pemahaman dasar tentang penerapannya pada fenik hpc.", "type": "cp"},
	{"kalimat": "dapat mengidentifikasi dan menjelaskan persyaratan aplikasi kontrol dan cps sistem cyber secara virtual sehubungan dengan solusi jaringan. dapat mencocokkan prinsip desain jaringan fisik maya dengan persyaratan aplikasi yang berbeda. memahami dan menjelaskan konsekuensi dari jaringan nirkabel besar dan atau kritis untuk lapisan yang lebih tinggi dari sistem komunikasi dapat mengidentifikasi tantangan penelitian terbuka utama dalam konteks jaringan fisik maya dan implikasinya dalam memenuhi tantangan sosial", "type": "cp"},
	{"kalimat": "mendorong adopsi kantor 365 dan tim microsoft untuk organisasi Anda sebagai contoh beban kerja dalam strategi adopsi layanan cloud. menulis strategi layanan kolaborasi dan komunikasi. menggunakan matriks hasil untuk mengukur dan memilih ukuran keberhasilan. struktur adopter awal dan program juara. bekerja dengan talenta teknis untuk memastikan kesiapan dan kualitas layanan. mengonfigurasikan metode umpan balik pengguna yang skalabel.", "type": "cp"},
	{"kalimat": "menganalisis data besar biologis n thow untuk menyelaraskan urutan protein untuk menemukan perbedaan dan menentukan struktur u00a0 u00a0 n tgenerate struktur model dari protein yang tidak diketahui u00a0 n u00a0", "type": "cp"},
	{"kalimat": "unsur-unsur formal dari permainan seperti tujuan dan mekanik dan desainer menentukan audiens yang sesuai dan kelompok pemain untuk permainan n twhat membuat genre permainan yang berbeda yang berbeda dan permainan desainer permainan n", "type": "cp"},
	{"kalimat": "bagaimana merekonstruksi genom dengan merangkai fragmen-fragmen kecilnya menggunakan alat perakitan genom populer untuk mengurutkan patogen bagaimana menemukan mutasi pada genom Anda dan bagaimana menguji apakah mereka terkait dengan penyakit genetik. menyelidiki susunan genetik ayah dan anak ibu u0022trio u0022 untuk mencari tahu apakah anak itu mewarisi penyakit dari orang tua atau mengembangkan penyakit genetik melalui mutasi de novo bagaimana menganalisis ekspresi gen bagaimana u0026nbsp menyelidiki gen apa yang dinyalakan atau dimatikan dalam berbagai jaringan untuk mengetahui gen mana yang penting untuk setiap jenis sel dan gen mana yang berlebihan terekspresi pada kanker dan penyakit lainnya.", "type": "cp"},
	{"kalimat": "bagaimana elemen-elemen yang berbeda dalam permainan video dibuat dan aset permainan video dibuat secara berbeda dari produk media lain dan aset yang datang bersama-sama dan siapa yang bertanggung jawab untuk membuat semua bagian bekerja bersama-sama n video yang mendapatkan u201cpolished u201d ke dalam pengiriman produk n", "type": "cp"},
	{"kalimat": "memahami alasan desain di balik teknologi blockchain. memahami komponen teknologi dan kriptografi dari sebuah blockchain. memahami variasi dan perbedaan dari platform blockchain utama yang ada. pahami jenis aplikasi apa yang paling sesuai dengan karakteristik blockchain. memahami keterbatasan dan masalah luar biasa dari teknologi blockchain yang ada. memahami dampak negatif dari kegiatan kriminal tertentu dalam konteks blockchain.", "type": "cp"},
	{"kalimat": "bagaimana menentukan masalah memecahnya menjadi langkah-langkah dasar mereka dan merancang algoritma dan abstraksi untuk memecahkannya n thow untuk memilih paradigma pemrograman yang tepat dan menulis program dalam paradigma ini untuk memecahkan masalah dan tidak menggunakan semantik formal untuk alasan tentang kebenaran program n thow untuk menulis program konkuren kecil dalam paradigma aliran data deterministik n", "type": "cp"},
	{"kalimat": "bagaimana cara menguji setiap sistem perangkat lunak menggunakan keadaan terkini dari alat-alat seni bagaimana mendapatkan kasus uji yang berhubungan dengan sudut luar biasa dan kasus cuaca buruk dengan menggunakan beberapa teknik yang berbeda keterbatasan teknik pengujian saat ini dan bagaimana memutuskan strategi pengujian terbaik untuk konteks tertentu bagaimana mengembangkan arsitektur yang dapat diuji dan menulis kode pengujian yang dapat dipertahankan", "type": "cp"},
	{"kalimat": "teori di balik pergeseran dari itu paradigma ke teknologi bisnis digital bt paradigma bagaimana lingkungan kekacauan dan pesanan simultan u0026nbsp bisa ada dalam organisasi yang cepat digitalisasi dampak transformasi digital pada peran itu dan tim cio cara di mana digitalisasi yang cepat ini menciptakan kebutuhan bagi para profesional bisnis dan profesional untuk mengarahkan kembali diri mereka ke arah pendekatan bisnis digital", "type": "cp"},
	{"kalimat": "pemodelan kendaraan jalan dalam arah lateral dan vertikal memanjang mengembangkan model matematika kausal dan akut dari sistem dinamikal melinierkan model waktu kontinu nonlinier mendapatkan model waktu diskrit dengan sampling konsep desain ruang negara terminologi diskrit waktu pengontrol umpan balik keadaan menganalisis model sistem dari observabilitas kemampuan kontrol dan stabilitas sudut pandang desain dan menganalisis pengamat dengan fokus pada filter kalman dan menerapkannya untuk estimasi negara.", "type": "cp"},
	{"kalimat": "anatomi konsep desain multicore berbasis komputer dan n yang digunakan dalam komputer multicore masa depan dan desain komputer mempengaruhi bagaimana energi yang efisien dan cepat program dapat dijalankan pada sistem komputer masa depan yang diajarkan konsep desain yang digunakan dalam sistem komputer multicore modern n", "type": "cp"},
	{"kalimat": "mengidentifikasi dan menganalisis iot keamanan dan risiko privasi nmendeseptir desain untuk mengamankan perangkat keras dan perangkat lunak n tanali dampak sosial dan privasi dari iot. n", "type": "cp"},
	{"kalimat": "Anda akan belajar bagaimana n nuse siklus eksperimen bisnis untuk memberikan hasil bisnis yang diinginkan n memadukan proses operasional desain modular dan metode tangkas untuk mengembangkan iteratif percobaan loop kecil yang menciptakan perbaikan berkelanjutan n menggunakan proses operasional desain modular dan metode tangkas untuk menggerakkan percobaan loop kecil n tidentify kebutuhan untuk dan mengelola risiko yang melekat dalam percobaan loop besar yang digunakan untuk menggerakkan perubahan yang mengganggu dan mengelola antarmuka pengetahuan di antara berbagai ahli yang terlibat dalam eksperimen loop besar n mengelola infrastruktur teknis dan organisasi Anda untuk mendorong kemampuan untuk eksperimen pada skala n", "type": "cp"},
	{"kalimat": "rencana perkiraan jadwal dan dokumen perangkat lunak pengujian n cacat perangkat lunak tmanage n thow untuk menghitung metrik pengujian perangkat lunak n tevaluate dan mengimplementasikan inisiatif kualitas perangkat lunak n", "type": "cp"},
	{"kalimat": "proses migrasi awan dan masalah u00a0 n proses bisnis untuk mengimplementasikan solusi cloud n standar teknologi cloud standar dan praktik terbaik n tcloud vendor manajemen n", "type": "cp"},
	{"kalimat": "mengevaluasi masalah keamanan dengan infrastruktur cloud n timplement fitur cloud untuk mengamankan dan mengeraskan infrastruktur dan alat-alat untuk menganalisis log sistem untuk mendeteksi kemungkinan masalah keamanan atau kinerja n studi kasus treview dan dokumen standar tentang keamanan cloud dan memahami penggunaan kebijakan keamanan sebagai bagian dari keseluruhan strategi keamanan suatu organisasi nt u00a0 ntn", "type": "cp"},
	{"kalimat": "klasifikasi regresi dan estimasi probabilitas bersyarat model generatif dan diskriminatif model linier dan ekstensi untuk nonlinier menggunakan metode kernel metode ensemble meningkatkan bagging hutan acak representasi belajar pengelompokan dimensi pengurangan autoencoders jaring yang dalam", "type": "cp"},
	{"kalimat": "pemrograman percikan menggunakan pyspark dan mengidentifikasi komputasional komputasi dalam aplikasi percikan dan melakukan pemuatan dan pembersihan data menggunakan percikan dan parketing data melalui metode statistik dan pembelajaran mesin n", "type": "cp"},
	{"kalimat": "batu nisan cybersecurity adalah praktik ketrampilan tangan dan penilaian berbagai pengetahuan yang diperoleh melalui program micromasters cybersecurity yang meliputi solusi pengimplementasian n u00b7 u00a0 u00a0 u00a0 untuk mengamankan sistem komputer dan jaringan n u00b7 u00a0 u00a0 u00a0 melakukan penyelidikan forensik digital kasus dunia nyata n u00b7 u00a0 u00a0 u00a0 mendeteksi dan menyelidiki intrusi jaringan.", "type": "cp"},
	{"kalimat": "dasar-dasar statistik bayesian dan teori estimasi rekursif mendeskripsikan dan memodelkan sensor umum dan pengukurannya membandingkan model gerakan tipikal yang digunakan untuk penentuan posisi guna mengetahui kapan menggunakannya dalam masalah praktis menggambarkan sifat-sifat penting dari kalman filter kf dan menerapkannya pada ruang status linear model mengimplementasikan filter nonlinier kunci dalam matlab untuk memecahkan masalah dengan gerakan nonlinier dan atau model sensor memilih metode filter yang sesuai dengan menganalisis properti dan persyaratan dalam aplikasi u0026nbsp", "type": "cp"},
	{"kalimat": "dasar-dasar jaringan dan administrasi sistem n dasar-dasar jaminan pertanggungjawaban seperti integritas kerahasiaan dan ketersediaan dll. konsep-konsep kriptografi n n", "type": "cp"},
	{"kalimat": "class n tobjects dan desain berorientasi objek n tfields dan visibility n tconstructors mutators and accessor methods n tencapsulation n tinterfaces n tthe list interface n tmethod overriding n", "type": "cp"},
	{"kalimat": "ide-ide kunci di balik teknik pengujian perangkat lunak canggih seperti mutasi dan pengujian berbasis properti keadaan saat ini dari seni dalam pengujian perangkat lunak penelitian seperti penggunaan kecerdasan buatan untuk mengotomatisasi kegiatan pengujian keterbatasan teknik pengujian saat ini dan bagaimana u0026nbsp menentukan pengujian terbaik strategi untuk konteks tertentu", "type": "cp"},
	{"kalimat": "perencanaan lini produk dan alternatif pemetaan jalan n tidea generasi pelanggan perlu penilaian co penciptaan u00a0 definisi dan validasi produk mvp minimal viable dan sekutu gabungan dokumen persyaratan n pendekatan talternatif untuk pengembangan ramping tangkas dan air terjun bersama dengan alat untuk menilai proyek tugas dan bisnis risiko dan strategi mitigasi risiko di scrum atau di gerbang panggung. n untuk meluncurkan produk dan menciptakan strategi pemasaran untuk memperjuangkan produk Anda. Kepemilikan manajemen kinerja produk terkait laba atau rugi selama berbagai tahapan siklus hidup cara melacak dan mengoptimalkan metrik kinerja sistem, sementara Anda juga dapat menggunakan media sosial dan data pihak ketiga terhadap optimalisasi kinerja n", "type": "cp"},
	{"kalimat": "untuk mengikuti proses siklus pemodelan matematika merumuskan dan menentukan masalah kehidupan nyata membangun persamaan diferensial biasa yang tepat dengan parameter yang relevan dan kondisi memecahkan persamaan diferensial biasa dan menerapkan metode euler u0026rsquo dalam program python memvalidasi hasil perhitungan menulis ilmiah laporkan pada lateks tentang model matematika yang Anda buat", "type": "cp"},
	{"kalimat": "polymorphism n tsuper kata kunci n kelas tabulasi dan metode n texceptions n ttry tangkap akhirnya struktur n tthrows kata kunci n dibatasi dan tidak tertangani kecuali n tarraylists n tgenerics n tbig o notation n analisis talgorithm n ngetik n tsorting n", "type": "cp"},
	{"kalimat": "pemahaman menyeluruh tentang multi-objek pelacakan mot dan pemahaman tingkat ahli tantangannya tentang teori prinsip dan algoritma dalam mot modern. luas tahu bagaimana memecahkan berbagai masalah mot dalam praktek. pengalaman berharga dari penerapan algoritme mot yang berbeda. u0026nbsp u0026nbsp", "type": "cp"},
	{"kalimat": "bagaimana menemukan mengisolasi dan memperbaiki bug alat debugging kuat cara untuk menangani pengecualian dengan benar bagaimana menggunakan tes unit untuk menutupi dan memverifikasi kode prinsip-prinsip dasar menulis kode berorientasi objek bagaimana membedakan perbedaan antara koleksi pentingnya kinerja aplikasi pemrograman paralel", "type": "cp"},
	{"kalimat": "praktik terbaik dan pedoman untuk membuat keputusan logis yang berkaitan dengan perancangan untuk beragam kemampuan alat yang efektif untuk membantu Anda membuat dan memodifikasi pertimbangan aplikasi desktop desktop yang kompleks kontrol", "type": "cp"},
	{"kalimat": "microsoft exchange server 2016 persyaratan prasyarat dan penyebaran mengelola server pertukaran microsoft 2016 dan objek penerima mengelola surat diaktifkan perizinan objek objek dan menerapkan folder kotak pesan publik merencanakan dan mengkonfigurasi keamanan administratif dan audit", "type": "cp"},
	{"kalimat": "merencanakan koeksistensi dengan pertukaran microsoft 2010 atau 2013 dan pertukaran 2016 mengimplementasikan koeksistensi dengan versi sebelumnya dari pertukaran microsoft exchange versi sebelumnya dari server pertukaran microsoft", "type": "cp"},
	{"kalimat": "teknik interaksi bagaimana terlibat secara efektif dengan rekan tim dan orang lain tentang gaya kolaborasi Anda apa gaya komunikasi Anda dan bagaimana Anda dapat terlibat dengan gaya lain dengan cara yang produktif dan bermakna n untuk membangun tim virtual Anda akan mendapatkan keterampilan yang berharga dalam berkolaborasi dengan tim yang didistribusikan di seluruh dunia n untuk memimpin dalam tim Anda akan mendapatkan prinsip-prinsip dasar yang diperlukan untuk secara efektif memimpin dalam tim baik lokal maupun dalam pengaturan virtual n", "type": "cp"},
	{"kalimat": "skype untuk ikhtisar online bisnis n timplement cloud pbx dan konektivitas pstn n timplement pstn conferencing n identitas tmanage antara di lokasi dan cloud n menilai jaringan kesiapan n tplan penyebaran dengan menggunakan kerangka kerja sukses adopsi n", "type": "cp"},
	{"kalimat": "merencanakan dan mengimplementasikan konektivitas klien dalam organisasi Anda mengimplementasikan dan mengkonfigurasi prospek pada implementasi web dan mengonfigurasi rencana olahpesan seluler dan mengonfigurasi layanan akses klien untuk rencana akses internet dan mengonfigurasi ketersediaan tinggi untuk layanan akses klien", "type": "cp"},
	{"kalimat": "pengetahuan tentang standar industri pengembangan kebijakan tata kelola ilmu bahasa umum", "type": "cp"},
	{"kalimat": "merancang dan mengonfigurasi penyebaran suara perusahaan n timplement fitur panggilan yang ditingkatkan n tmanage ip phones n timplement pemanggilan darurat n untuk mengintimize jaringan untuk suara nmonitor dan menjaga kualitas suara n", "type": "cp"},
	{"kalimat": "rencana dan desain microsoft exchange 2016 mailbox server merencanakan dan mengimplementasikan rencana ketersediaan tinggi kotak surat dan mengimplementasikan rencana solusi tangguh situs kotak pesan dan mengimplementasikan pemulihan cadangan dan pemulihan basis data kotak surat", "type": "cp"},
	{"kalimat": "membuat dan mengelola penerima pertukaran n tmanaging alamat email dan domain n tplanning untuk pertukaran perlindungan online n tmanage pertukaran layanan online n thow untuk mengimplementasikan migrasi kotak surat n", "type": "cp"},
	{"kalimat": "teknik-teknik pelatihan yang efektif n menghasilkan konten bermanfaat yang dapat dipakai dan mendorong kerja sama produktif untuk tim-tim n mempromosikan peningkatan pengendalian n", "type": "cp"},
	{"kalimat": "apa yang akan Anda pelajari n nidentify masalah konfigurasi firewall n skype ttrace untuk komunikasi bisnis dengan cls dan log klien dan pelacakan jejak dan pesan dengan snooper n ttroubleshoot skype untuk tanda bisnis dalam proses n ttroubleshoot konfigurasi suara perusahaan n", "type": "cp"},
	{"kalimat": "mengkonfigurasi transportasi dan routing dalam rencana pertukaran microsoft 2016 untuk rencana keamanan pesan dan mengkonfigurasi ketersediaan transportasi tinggi dan ketahanan situs mengimplementasikan solusi antivirus untuk server pertukaran microsoft 2016 menerapkan solusi anti spam untuk server pertukaran microsoft 2016", "type": "cp"},
	{"kalimat": "menggambarkan fase dan tahapan kerangka operasi skype. u0026nbsp menjelaskan berbagai skenario penyebaran dalam kerangka operasi skype. menentukan pemangku kepentingan yang tepat dan peran mereka dalam menyebarkan skype untuk bisnis. mendeskripsikan strategi penempatan proksi Office 365. menentukan infrastruktur dan kesehatan berkualitas panggilan di mana skype untuk bisnis akan dikerahkan. mengadakan lokakarya yang menentukan pedoman penerapan dan mendukung migrasi klien. membuat peluncuran situs dan rencana migrasi. deskripsikan tugas operasional skrip mingguan dan bulanan harian untuk bisnis.", "type": "cp"},
	{"kalimat": "bagaimana memilih teknologi yang tepat untuk proses dan strategi metode kerja untuk pemilihan teknologi bagaimana mengimplementasikan solusi", "type": "cp"},
	{"kalimat": "memahami manfaat microsoft fasttrack dan melakukan tperform penilaian lingkungan Anda n untuk melakukan remediasi lingkungan Anda dan memungkinkan kantor Anda menyewakan sistem email Anda ke office 365 menggunakan proses migrasi fasttrack n", "type": "cp"},
	{"kalimat": "merencanakan menyebarkan dan mengelola rencana federasi penukaran microsoft dan mengelola rencana otentikasi berbasis penyebaran oauth hibrida dan mengonfigurasi persyaratan sertifikat dan firewall untuk rencana penyiapan hibrid hibrida dan mengonfigurasi persyaratan aliran email", "type": "cp"},
	{"kalimat": "bagaimana mengidentifikasi masalah dengan layanan akses klien pemecahan masalah database kotak surat memperbaiki masalah layanan transportasi mengelola federasi hibrida dan komponen lainnya", "type": "cp"},
	{"kalimat": "skype untuk server bisnis 2015 ikhtisar n tplan skype untuk penyebaran server bisnis n menginstal skype untuk server bisnis n tupgrade dari server lync ke skype untuk server bisnis n skype tmanage untuk pengguna bisnis dan klien n", "type": "cp"},
	{"kalimat": "mengelola dan memecahkan masalah skype untuk penyebaran server bisnis n tplan dan menyebarkan skype untuk konferensi web server bisnis dan konferensi besar n tplan dan menyebarkan dial dalam konferensi n tplan dan menyebarkan sistem ruang skype n tplan dan menyebarkan akses eksternal ke skype untuk penyebaran server bisnis n", "type": "cp"},
	{"kalimat": "merencanakan dan menyebarkan skype hibrida untuk lingkungan server bisnis dan menerapkan ketersediaan tinggi untuk semua skype untuk komponen server bisnis n tplan dan menerapkan pemulihan bencana untuk semua skype untuk komponen server bisnis n tplan dan menyebarkan pemantauan dan pengarsipan n tplan dan menyebarkan obrolan tetap n", "type": "cp"},
	{"kalimat": "dhcp perannya dan bagaimana mengkonfigurasi dan mengelola konfigurasi protokol dns dan manajemen jaringan yang sedang berlangsung", "type": "cp"},
	{"kalimat": "teknologi virtualisasi apa yang tersedia dan kapan mereka harus digunakan bagaimana mengonfigurasi hyper v virtual machines virtual storage dan virtual networks bagaimana menggunakan windows server containers dengan docker", "type": "cp"},
	{"kalimat": "menyimpan data terstruktur menggunakan tabel api azure cosmos db core fitur kemampuan u0026amp mengembangkan database u0026nbsp dengan api documentdb membangun database grafik dengan api pembuatan database gremlin menggunakan api mongodb mengintegrasikan kosmos db ke layanan database lainnya", "type": "cp"},
	{"kalimat": "disiplin jaminan kualitas data sql server dqs kemampuan dan fitur membuat dqs solusi ssis dqs pembersihan komponen pencocokan kebijakan dan proyek administrasi pembaruan kursus dqs sebagai dari 31 Maret 2017 pasar azure data adm akan pensiun dan topik membahas layanan data referensi akan dihapus dari pembaruan kursus terbaru ini. tidak ada perubahan yang akan dilakukan pada contoh kursus sebelumnya.", "type": "cp"},
	{"kalimat": "manfaat dari pengorganisasian aset data organisasi azure katalog data pola adopsi kemampuan dan fitur membuat katalog mendaftarkan data aset annotating dan menemukan aset data yang mendefinisikan dan mengelola glosarium bisnis yang menemukan aset data yang mengelola katalog", "type": "cp"},
	{"kalimat": "cara memilih strategi cadangan untuk memenuhi waktu pemulihan dan tujuan titik pemulihan cara membuat cadangan basis data dan log transaksi bagaimana mengelola cadangan cara mengembalikan basis data cara melakukan titik pemulihan waktu", "type": "cp"},
	{"kalimat": "mengelola server sql dengan agen server sql dan pemantauan powershell dan pemecahan masalah sql server dengan dibangun dalam pandangan sistem utilitas dan memperpanjang acara mempertahankan backup server sql pembaruan indeks statistik dan pemeriksaan integritas", "type": "cp"},
	{"kalimat": "memahami penawaran layanan cloud Azure u0027s membuat dan menyebarkan aplikasi seluler menggunakan layanan aplikasi biru mengkonfigurasikan penerapan berkelanjutan menggunakan github menggunakan wawasan aplikasi untuk menulis pertanyaan telemetri aplikasi dan menganalisis hasil memahami manfaat dan fitur sistem kudu dan menerapkan pencatatan", "type": "cp"},
	{"kalimat": "mengakses database relasional dengan ado.net n tbuild aplikasi klien lintas platform data dengan entitas kerangka inti n teknik akses data yang maju dengan entitas kerangka n tbuild istirahat apis dengan kerangka entitas dan web api n", "type": "cp"},
	{"kalimat": "cara mengkonfigurasi solusi hybrid sharepoint n cara cara berbagi solusi hibridpoint untuk layanan konektivitas bisnis microsoft onedrive untuk profil bisnis dan ekstranet berbagi langkah-langkah teknis tentang cara mengkonfigurasi pemecahan masalah dan mengelola lingkungan hibrida SharePoint dan memahami manfaat yang datang dengan masing-masing solusi hibrida n", "type": "cp"},
	{"kalimat": "membuat dan mengkonfigurasi perencanaan manajemen metadata pencarian perusahaan dan perencanaan konfigurasi konfigurasi perencanaan dan konfigurasi manajemen", "type": "cp"},
	{"kalimat": "perencanaan lingkungan berbagi Anda n mengembangkan model tata kelola untuk menerapkan n merancang struktur taksonomi yang mudah digunakan dan mengembangkan proses yang kuat untuk mengelola konten perusahaan n", "type": "cp"},
	{"kalimat": "membuat dan mengonfigurasi infrastruktur berbagi-pusat kantor 365 membuat dan mengonfigurasi taksonomi dan integrasi pencarian kaya mengelola situs dan solusi mengimplementasikan add ins mengelola izin", "type": "cp"},
	{"kalimat": "mengidentifikasi kategori dan menandai gambar menginterpretasikan gambar untuk karakteristik seperti wajah suasana hati dan adegan melakukan pengindraan karakter optik dalam gambar yang secara cerdas memanipulasi foto untuk membangun aplikasi penggubah gambar", "type": "cp"},
	{"kalimat": "bagaimana mengimplementasikan penyimpanan data dan penyimpanan ruang penyimpanan iscsi. bagaimana menggunakan sistem file terdistribusi dan branchcache. u0026nbsp cara menerapkan failover pengelompokan failover dasar dan lanjutan. u0026nbsp", "type": "cp"},
	{"kalimat": "pemahaman jaringan topologi pemahaman lans wans dan pemahaman internet jaringan nirkabel dan kabel memahami protokol jaringan pemahaman tcp ip troubleshooting jaringan menggunakan alat jaringan yang sudah ada", "type": "cp"},
	{"kalimat": "cara mengonfigurasi dan mengelola teknologi akses jarak jauh seperti vpn proxy aplikasi web dan routing. cara mengkonfigurasi dan mengelola rds layanan desktop jauh. bagaimana mengelola infrastruktur jaringan virtual menggunakan perangkat lunak jaringan yang didefinisikan sdn.", "type": "cp"},
	{"kalimat": "bagaimana cara mengimplementasikan server nano. cara mengkonfigurasi hyper v untuk menjalankan vms dengan sistem operasi linux dan freebsd. cara mengkonfigurasi saklar virtual baru dan fitur jaringan virtual. bagaimana vms terlindung dan kain pelindung tuan rumah melindungi lingkungan virtual Anda. bagaimana merencanakan strategi cadangan dan pemulihan untuk lingkungan yang tervirtualisasi. bagaimana mengurangi downtime dengan strategi migrasi seperti migrasi migrasi hidup cepat dan hiper v replika.", "type": "cp"},
	{"kalimat": "cara menggunakan fsasi iklan federasi direktori aktif fs untuk memberikan identitas federasi dan tanda tunggal pada pengguna Anda. implementasi microsoft identity manager mim dan privileged access management pam untuk secara mulus menjembatani banyak di toko-toko otentikasi lokal. pemanfaatan layanan manajemen hak direktori aktif ad u0026nbsp rms untuk membantu menjaga informasi digital dari penggunaan yang tidak sah. bagaimana menggunakan cukup administrasi jea untuk secara efektif mendelegasikan dan membatasi hak administrator.", "type": "cp"},
	{"kalimat": "komponen yang berbeda dari pusat sistem menginstal dan mengkonfigurasi manajer mesin virtual pusat sistem menyebarkan dan mengelola penyimpanan komputasi dan kain jaringan menyebarkan dan mengelola mesin virtual", "type": "cp"},
	{"kalimat": "masalah bisnis platform data umum seperti keamanan tata kelola data lintas batas dan pilihan teknologi skala global untuk penyimpanan dan orkestrasi dan pelaporan pola data umum untuk seri waktu sistem transaksional dan solusi data hibrida", "type": "cp"},
	{"kalimat": "apa yang nosql menyimpan data xml di sql server menggunakan data spasial dalam pertimbangan server sql untuk penyimpanan data gumpalan menyimpan dan mengembalikan json mengintegrasikan sql server dengan u0026nbsp biru cosmos db", "type": "cp"},
	{"kalimat": "berbagai jenis awan dan pertimbangan awan pribadi menciptakan awan dalam manajer mesin virtual dan mengonfigurasi kapasitas dan kemampuan membuat peran pengguna delegasi izin dan penetapan kuota yang membuat peran pengguna layanan mandiri dan mengonfigurasi izin untuk pengguna layanan mandiri", "type": "cp"},
	{"kalimat": "membuat desain arsitektur informasi desain arsitektur logis penyediaan arsitektur fisik server pertanian sharepoint mengkonfigurasi integrasi kantor server online", "type": "cp"},
	{"kalimat": "membuat dan memelihara koleksi situs n tplan sharepoint ketersediaan tinggi dan solusi pemulihan bencana n tplan cadangan dan memulihkan n tplan dan mengkonfigurasi beban kerja sosial n tplan dan mengkonfigurasi beban kerja manajemen konten web n", "type": "cp"},
	{"kalimat": "praktek perencanaan yang kuat n tamiless dengan arsitektur sharepoint n tunderstand konfigurasi yang diperlukan n tmanagement dari sharepoint hybrid n tplatform kebersihan dan persiapan n sinkronisasi t nirektori n tconfiguration dari satu tanda tunggal pada pengalaman untuk pengguna n", "type": "cp"},
	{"kalimat": "buat dan konfigurasikan manajemen aplikasi buat dan konfigurasikan layanan produktivitas buat dan konfigurasikan layanan konektivitas bisnis dan aplikasi penyimpanan aman kelola solusi dan aplikasi sharepoint", "type": "cp"},
	{"kalimat": "menjelajahi jaringan skala besar dengan struktur dan properti yang berbeda belajar representasi grafik menggunakan pembelajaran mendalam yang mendalam dan teknik penyisipan menggunakan dasar-dasar nlp untuk membangun grafik pengetahuan menggunakan grafik pengetahuan dalam aplikasi modern yang memperagakan grafik pengetahuan menggunakan metode penyematan.", "type": "cp"},
	{"kalimat": "tangan di laboratorium ini akan menguji kemampuan Anda dalam bidang-bidang berikut ini bagaimana mempertahankan u0022perusahaan Anda u0022 dari skenario serangan multi langkah dari peretasan simulasi. Menemukan bagaimana jaringan dan layanan Anda rentan terhadap serangan peretas. memahami cara menerapkan kontrol keamanan dan memprioritaskan pemulihan layanan yang dikompromikan. memungkinkan siswa untuk mengevaluasi berbagai layanan keamanan microsoft dan non microsoft.", "type": "cp"},
	{"kalimat": "membuat u0026ldquo dipandu pengalaman bot percakapan u0026rdquo mengintegrasikan basis pengetahuan ke dalam pengalaman bot membuat model pemahaman bahasa mengintegrasikan pemahaman bahasa ke dalam pengalaman bot mengintegrasikan sintesis ucapan ke dalam pengalaman bot menyebarkan bot ke saluran pihak ketiga mengembangkan bot sebagai keterampilan cortana membangun bot keterampilan cortana yang memanfaatkan keunggulan ai", "type": "cp"},
	{"kalimat": "menerjemahkan konten lisan ke bahasa lain melakukan sintesis ucapan dan pengenalan menggantikan otentikasi standar dengan verifikasi suara mengintegrasikan perintah pidato ke dalam pengalaman aplikasi mengidentifikasi pembicara melalui identifikasi suara membangun aplikasi pengenalan ucapan dan pembicara", "type": "cp"},
	{"kalimat": "mengembangkan pernyataan yang menjelaskan keadaan dalam suatu program. n tprove program yang benar menggunakan logika. n membangun algoritma menggunakan teknik pemrograman berorientasi tujuan. n t u201cslice dan dce u201d untuk menemukan keluarga algoritma berbasis loop untuk perhitungan matriks. n", "type": "cp"},
	{"kalimat": "bagaimana mendeskripsikan metodologi direct fem simulation dfs termasuk adaptive error control slip boundary condition u0026nbsp dan metode disipasi turbulen untuk menurunkan estimasi stabilitas untuk cg 1 cg 1 fem diterapkan pada persamaan stok navier bagaimana memperhitungkan algoritma fem secara umum seperti adaptvitas perakitan dan lokal penyempurnaan mesh dan memiliki pemahaman dasar tentang implementasi mereka di fenics hpc bagaimana memperhitungkan struktur data paralel dan algoritma untuk arsitektur memori terdistribusi dalam kerangka kerja fem yang umum dan memeriksa implementasi mereka dalam fenics hpc distributed computational mesh ghost entities didistribusikan sparse linear dan non linear aljabar penyempurnaan mesh lokal oleh pembelahan untuk mesh komputasi terdistribusi dan tujuan umum yang berorientasi pada cara-cara kontrol kesalahan adaptif untuk memperkirakan kinerja dari berbagai algoritma paralel bagaimana menggunakan kerangka kerja umum seperti fenics hpc untuk memodelkan dan memecahkan pde umum pada superkomputer dan khususnya ae masalah rodynamics dengan dfs", "type": "cp"},
	{"kalimat": "membuat prosedur yang tersimpan menciptakan pemicu menciptakan fungsi yang ditetapkan pengguna mengimplementasikan kode yang dikelola dengan sqlclr sql runtime bahasa umum kode implementasi dengan r", "type": "cp"},
	{"kalimat": "dalam kursus ini, Anda akan mempelajari teori dan teknik untuk merancang laporan dan dasbor yang bermakna dan akurat secara visual dari pengarsipan data bisnis dan penerbitan laporan laporan seluler dan indikator kinerja utama kpis menggunakan fitur layanan pelaporan server sql seperti parameter grafik ekspresi kartu skor dan dasbor", "type": "cp"},
	{"kalimat": "mengeksplorasi kemungkinan proses data sains dan statistik dalam eksplorasi data sains data dan visualisasi pembersihan dan pengenalan penyaringan data transformasi untuk pembelajaran mesin tangan pada elemen kursus ini memanfaatkan kombinasi r python dan microsoft machine machine biru", "type": "cp"},
	{"kalimat": "mengeksplorasi klasifikasi regresi dalam pembelajaran mesin bagaimana meningkatkan rincian model yang diawasi pada pemodelan pengelompokan pemodelan non linier tangan pada unsur-unsur kursus ini memanfaatkan kombinasi r phython dan microsoft mesin belajar biru", "type": "cp"},
	{"kalimat": "menjelajahi dasar-dasar bahasa r termasuk variabel sintaks dasar dan jenis n thow untuk membuat fungsi dan menggunakan aliran kontrol. n tdetails pada membaca dan menulis data dalam r n twork dengan data dalam rcenciptakan dan menyesuaikan visualisasi menggunakan ggplot2 n menganalisa prediktif analitik menggunakan r n", "type": "cp"},
	{"kalimat": "apa pembelajaran mesin dan jenis masalah itu mahir untuk memecahkan n thow untuk mewakili data mentah dengan cara yang kondusif untuk menurunkan informasi berharga n thow untuk menggunakan berbagai teknik visualisasi data n thow menggunakan analisis komponen utama dan isomap secara cerdas untuk menyederhanakan data Anda n thow untuk menerapkan algoritma pembelajaran diawasi untuk data Anda seperti hutan acak dan mendukung pengklasifikasi vektor n tkonten seperti pemilihan model pipelining dan validasi silang n", "type": "cp"},
	{"kalimat": "node.js dan node paket manager angular dan bootstrap yeoman jslint minify dan sass angular routing and providers", "type": "cp"},
	{"kalimat": "pemrograman dasar dalam javascript berorientasi objek pengantar javascript ke pengenalan perpustakaan node.js untuk visualisasi data menggunakan pustaka populer d3.js", "type": "cp"},
	{"kalimat": "setelah menyelesaikan kursus ini Anda akan bisa mendapatkan data input pengguna dan memanipulasinya menggunakan python. menerapkan struktur python dasar seperti jika loop dan fungsi laporan. membaca dan menulis file data eksternal menggunakan python. mengimplementasikan fungsi dan memanggil fungsi python yang dibangun. mengimpor dan menggunakan modul fungsi perpustakaan dari pustaka python. debug seluruh program dan menangani kesalahan dalam python.", "type": "cp"},
	{"kalimat": "memahami cara kerja arsitektur membuat kumpulan situs yang membuat izin pengguna bekerja dengan penelusuran dan memaksimalkan nilainya bekerja dengan fitur produktivitas untuk memaksimalkan kolaborasi sebagaimana yang diperlukan untuk organisasi.", "type": "cp"},
	{"kalimat": "u25cf memahami pengarsipan dan retensi arsitektur kantor 365 nn u25cf mengimplementasikan fitur pengarsipan dan retensi data kantor 365 nn u25cf melaksanakan pencegahan kebocoran data di kantor 365 nn u25cf cara menggunakan pengarsipan dan retensi di organisasi Anda nn u25cf pencegahan kebocoran data dan berbagai macam pemecahan masalah tipikal pengarsipan dan masalah pencegahan kebocoran data di kantor 365", "type": "cp"},
	{"kalimat": "kantor 365 ikhtisar n tprovisioning kantor 365 penyewa dan penyewa klien untuk mengakses kantor 365 penyewa dan tconfiguring domain kustom n tplanning konektivitas jaringan ke kantor 365 n toverview administrasi kantor 365 n menerapkan manajemen hak direktori aktif biru n pemantau dan pemecahan masalah kantor 365 n", "type": "cp"},
	{"kalimat": "Ringkasan klien Office 365 n tconfigure office 365 klien konektivitas n tmanage user driven klien penyebaran n tmanage terpusat klien penyebaran n tconfigure office 365 telemetri n", "type": "cp"},
	{"kalimat": "apa yang akan Anda pelajari tentang kelompok keamanan pengguna nmanage dan lisensi untuk identitas cloud di kantor 365 n tplan dan menerapkan sinkronisasi identitas dengan iklan biru menghubungkan dan menerapkan identitas federasi dengan layanan federasi direktori aktif n", "type": "cp"},
	{"kalimat": "mendiskusikan berbagai jenis data untuk neuroscience simulasi dan mengumpulkan annotate dan mendaftarkan berbagai jenis data neuroscience n mendeskripsikan strategi neuroscience simulasi n tcategorize fitur klasifikasi yang berbeda dari neuron n tlist karakteristik yang berbeda dari sinapsis dan aspek perilaku n tmodel neuron dengan semua bagian soma dendrites axon synaps dan perilakunya n memadukan data eksperimen pada aktivitas neuronal untuk membatasi sebuah model n", "type": "cp"},
	{"kalimat": "proyek ini adalah tentang menggabungkan berbagai keterampilan yang Anda peroleh melalui program micromasters. mereka termasuk n nlisting layanan yang terlibat dengan ex aplikasi arsitektur android. manajer aktivitas melihat manajer pemberitahuan penyedia konten manajer sumber daya dll. n tidentifying teknik yang berbeda untuk merencanakan desain dan prototipe aplikasi seluler Anda sebelum menulis kode apa pun yang mematuhi prinsip-prinsip desain material untuk membangun antarmuka menarik yang menarik untuk aplikasi android Anda dan membuat layout menggunakan xml dan menggunakan kode java . t tusing berbagai pandangan misalnya tombol kotak teks dan centang kotak dan mengimplementasikan menu berdasarkan navigasi laci atau tata letak antarmuka. n t timplement menu u00ad berdasarkan atau navigasi laci. membangun opsi menu untuk navigasi bilah tindakan. ntn tdetermining kasus penggunaan yang tepat untuk data tetap lokal dan merancang solusi untuk mengimplementasikan penyimpanan data menggunakan preferensi file dan database n membuat aplikasi menggunakan versi baru firebase n tunderstanding penggunaan model tampilan presenter mvp n tevideencing pengetahuan terintegrasi dengan api pihak ketiga facebook facebook n tunderstanding bagaimana memasukkan fitur yang memperluas aplikasi audiens u2019s melalui lokalisasi n twriting dan mengeksekusi tes instrumentasi otomatis pada perangkat android n membuat kode untuk menampilkan banner dan iklan interstisial dalam aplikasi n tpublishing aplikasi Anda. n", "type": "cp"},
	{"kalimat": "pemrograman di awal konsep pemrograman luas loop variabel struktur data", "type": "cp"},
	{"kalimat": "menghargai kebutuhan perangkat lunak dari proyek iot n mengerti bagaimana data dikelola dalam jaringan i n solusi perangkat lunak tapply untuk sistem yang berbeda dan data besar untuk desain konsep iot Anda dan membuat skrip python untuk mengelola file data besar yang dikumpulkan dari data sensor dan berinteraksi dengan dunia nyata melalui aktuator dan perangkat output lainnya. n", "type": "cp"},
	{"kalimat": "memahami mekanisme dasar dari kelas oop paradigma antarmuka pewarisan polimorfisme u00a0etc. n mengembangkan program dengan conditional dan loop n tdesign dan mengimplementasikan algoritma rekursif n twriting kompilasi dan menjalankan aplikasi java dasar n tintroduction untuk instalasi dan pengaturan android sdk android dan emulator android n", "type": "cp"},
	{"kalimat": "mengidentifikasi teknik yang berbeda untuk merencanakan desain dan membuat prototipe aplikasi seluler Anda sebelum menulis kode apa pun untuk memahami siklus hidup aplikasi dan komponen utamanya nmembuat antarmuka pengguna grafis gui n timplement aplikasi khusus tema n mendefinisikan daftar item daur ulang n timplement menu berdasarkan atau navigasi laci n mengintegrasikan kode dari pustaka dukungan eksternal u00a0 n tschedule tugas yang sensitif waktu menggunakan alarm n tschedule tugas latar belakang menggunakan penjadwal pekerjaan n merancang dan membangun aplikasi android fungsional dan aplikasi android yang menggunakan berbagai alat dan plugin yang berbeda dan memahami Anda lingkungan pengembangan android n tregister dan penerbitan di play store n", "type": "cp"},
	{"kalimat": "firebase dan android n tmodel tampilan presenter mvp n tclean arsitektur android n tcreate dan menampilkan pemberitahuan kepada pengguna n membangun minimal 5 aplikasi android nt 01 aplikasi membangun aplikasi obrolan dasar ntt 02 aplikasi membuat aplikasi twitter ntt 03 aplikasi mengintegrasikan facebook dengan saya aplikasi resep facebook ntt 04 app jaringan sosial Anda foto-foto ntt 05 app membangun aplikasi pencatatan untuk android ntn thow untuk menjamin kualitas kinerja terbaik yang mungkin dan responsif dari aplikasi n mengintegrasikan kode dari pustaka dukungan eksternal n menggunakan sistem log untuk output informasi debug n", "type": "cp"},
	{"kalimat": "cara memonetisasi aplikasi Anda untuk meningkatkan pengalaman pengguna membuat kode untuk menampilkan iklan spanduk dan interstisial dalam lisensi aplikasi dan memantau aplikasi Anda memublikasikan aplikasi Anda", "type": "cp"},
	{"kalimat": "konsep desain dalam komputer berbasis multicore modern termasuk prosesor dan hierarki memori, bagaimana hemat energi dan cepat program akan dijalankan bagaimana menggunakan model sederhana untuk menganalisis efisiensi energi dan kinerja.", "type": "cp"},
	{"kalimat": "komputasi etis n tbasic perangkat keras komputer n tnumber representasi n tjava struktur program n tsimple input output n tdata jenis dan variabel n tassignment pernyataan n tipe tprimitive dan tipe referensi n operator tarithmetic n tmath library n kelas tstring dan metode n tinteger dan double class n tboolean type n operator trelational n tselection statements n tshort circuit operation n tdemorgan u0027s undang-undang n", "type": "cp"},
	{"kalimat": "html css dan javascript dasar-dasar n thow untuk menyusun kode html termasuk elemen media referensi sumber daya eksternal dan gaya css terpisah dari kode html n thow untuk membuat aplikasi web yang interaktif dan tidak menggunakan properti css lanjutan untuk membuat aplikasi yang menarik dan memahami dan menerapkan konsep-konsep pemrograman dasar seperti loop dan array n konsep javascript dan pengenalan dasar untuk web apis json dan ajax n", "type": "cp"},
	{"kalimat": "ada empat tujuan utama untuk kursus untuk memberikan survei yang luas tentang pendekatan dan teknik dalam pembelajaran mesin u0026nbsp untuk mengembangkan pemahaman yang lebih dalam tentang beberapa topik utama dalam pembelajaran mesin untuk mengembangkan keterampilan desain dan pemrograman yang akan membantu Anda untuk membangun artifak adaptif cerdas untuk mengembangkan keterampilan dasar yang diperlukan untuk mengejar penelitian dalam pembelajaran mesin.", "type": "cp"},
	{"kalimat": "Dasar-dasar analisis regresi seperti regresi linier regresi linier umum dan pemilihan model landasan fundamental dalam penggunaan beberapa alat yang banyak digunakan tetapi banyak energi dari kursus adalah fokus pada penyelidikan dan pembelajaran individu.", "type": "cp"},
	{"kalimat": "membangun dan model kueri menerapkan perutean membuat model dan pengontrol yang merespons tindakan pengguna menggunakan parameter pengontrol untuk memengaruhi konten yang dikembalikan dalam kode penulisan actionresult dalam filter tindakan yang dijalankan sebelum atau setelah tindakan pengontrol. membuat model yang secara otomatis menghasilkan elemen ui berdasarkan tindakan atau peristiwa membuat model yang melakukan validasi memvalidasi masukan pengguna dengan anotasi data menggunakan penolong tag bekerja dengan kerangka entitas inti menerapkan otentikasi dasar dan otorisasi", "type": "cp"},
	{"kalimat": "Permintaan pengguna cepat prototyping pemahaman tugas-tugas pengguna desain antarmuka prinsip-prinsip desain visual", "type": "cp"},
	{"kalimat": "konstruksi fault tolerant untuk pendekatan perhitungan kuantum terhadap kompleksitas algoritma kuantum supremasi kuantum", "type": "cp"},
	{"kalimat": "algoritma kuantum tingkat kuantum kapasitas saluran prinsip-prinsip teori informasi kuantum", "type": "cp"},
	{"kalimat": "Anda akan belajar bagaimana membuktikan sejumlah teorema yang indah termasuk penyembah u0027s theorem the banach tarski theorem dan g u0026ouml del u0027s theorem. Anda akan memperoleh kemampuan untuk berpikir keras tentang paradoks dan masalah terbuka lainnya. Anda akan belajar tentang fenomena di batas teori kami di mana alat-alat matematika standar kami tidak selalu efektif.", "type": "cp"},
	{"kalimat": "kerangka kerja logis dan konseptual penyimpulan tujuan dan kekuatan metode pengacakan ulang penggabungan antara ukuran sampel dan ketepatan pengujian hipotesis t tingkat kepercayaan bootstrap ta b pengujian dan tes lain dari hipotesis untuk menginterpretasikan hasil tes tesis", "type": "cp"},
	{"kalimat": "matriks kerapatan bising operasi kuantum maju kode koreksi kesalahan kuantum", "type": "cp"},
	{"kalimat": "untuk memahami konstruksi utama teori rekayasa perangkat lunak terdistribusi secara global. bagaimana menerapkan prinsip-prinsip rekayasa perangkat lunak terdistribusi secara global dalam praktik perusahaan Anda sendiri. untuk menghasilkan artefak yang menambah keseluruhan pengetahuan tentang rekayasa perangkat lunak yang didistribusikan secara global. untuk mengidentifikasi konsep-konsep utama dalam pengambilan keputusan dan peran kepemimpinan dalam konteks yang terdistribusi secara global.", "type": "cp"},
	{"kalimat": "model formal untuk kebisingan kuantum dan saluran komunikasi kuantum kode koreksi kesalahan kuantum sederhana termasuk kode hamum quantum distribusi kunci kuantum protokol didistribusikan protokol kuantum dan algoritma", "type": "cp"},
	{"kalimat": "bagaimana menggunakan komputasi untuk membantu data Anda menceritakan kisah mereka n tbasic python 3 dan bagaimana menggunakannya sebagai sebagai alat untuk analisis data n tfundamental prinsip dan metode visualisasi n", "type": "cp"},
	{"kalimat": "bagaimana merancang dan membuat aplikasi seluler android menggunakan penemu aplikasi dan prinsip ilmu komputer berlaku untuk pemrograman algoritma internet dan masyarakat dan berpikir kreatif secara analitis dan abstrak tentang masalah komputasi u00a0 n", "type": "cp"},
	{"kalimat": "beban kesehatan global n merancang pemikiran n informatika kesehatan dan proses pengembangan n n tevaluasi dan pemantauan n", "type": "cp"},
	{"kalimat": "mekanika kuantum pengukuran kuantum perhitungan klasik reversibel", "type": "cp"},
	{"kalimat": "dasar-dasar pemrograman komputer menggunakan snap berdasarkan goresan dan menerapkan ide-ide besar u0022 dari data abstraksi kreativitas dan algoritma informasi pemrograman internet dan dampak global n untuk menguasai enam praktik komputasi komputasional menghubungkan komputasi yang menciptakan artefak komputasi abstrak menganalisa masalah dan artefak yang berkomunikasi dan berkolaborasi n", "type": "cp"},
	{"kalimat": "ide-ide dasar dari kriptografi kuantum konsep kriptografi dan alat keamanan definisi protokol amplifikasi privasi entropi min dan bukti keamanan untuk distribusi kunci kuantum dasar-dasar perangkat kriptografi kuantum independen tugas kriptografi kuantum modern dan protokol", "type": "cp"},
	{"kalimat": "apa yang seorang ilmuwan komputer tidak melakukan operasi dasar dan kemampuan komputer n pemecahan masalah talgorithmic dan program debugging n tautomating proses-proses dasar menggunakan komputer dan twriting program dasar menggunakan bahasa pemrograman modern n", "type": "cp"},
	{"kalimat": "event driven concurrent programming dari distributed algorithm n model tformal dari asynchronous systems menggunakan input output automata n tfailure detectors dan ekuivalensi antara berbagai abstraksi yang terdistribusi nspesifikasi dan algoritma untuk penyiaran perintah yang dapat diandalkan dan kausal n tdistributed shared memory dan konsistensi model n tsingle value consensus dan konsensus terkait algoritma u00a0 termasuk paxos. n", "type": "cp"},
]