[
	{"kalimat": "1. Pengertian Algoritma dan Pemrograman; Perbedaan antara POP and OOP; Elemen - elemen dasar C++;Input and Output Stream 2. Struktur Kontrol dan Operator 3. Data Struktur dan Fungsi 4. Algoritma Pengurutan dan Pencarian Data 5. Operasi File 6. Object-Oriented Programming; Class and Model Objek 7. Constructors and Destructor; Nesting Object and Friend; Operator Overloading 8. Inheritance 9. Polymorphism 10. Generic Programming", "type": "pb"},
	{"kalimat": "Konsep Basis Data   Objek Basis Data Relasional   ERD   Mapping   Database Designer   Normalisasi   Aljabar Relasional   SQL   Perancangan Basis Data dalam RDBMS   Pembuatan Aplikasi dengan RDBMS", "type": "pb"},
	{"kalimat": "1. instalasi docker2. docker-compose3. pengelolaan memory", "type": "pb"},
	{"kalimat": "Pokok bahasan perkuliahan terdiri dari: ·         Konsep dalam desain interaksi, ·         pemahaman dan konseptualisasi interaksi, ·         aspek kognitif, ·         perancangan untuk kolaborasi & komunikasi, ·         pengaruh antarmuka, ·         proses dalam interaksi desain, ·         pembuatan prototip, ·         perancangan interaksi yang berorientasi pada user, ·         pengenalan tentang evaluasi dan ragam teknik untuk usability testing, ·         studi kasus perancangan antarmuka dan interaksinya dalam pengembangan perangkat lunak.", "type": "pb"},
	{"kalimat": "Pengantar Jaringan Komputer. Model Referensi OSI dan TCP/IP .  Protokol dan Fungsionalitas Layer Aplikasi. Protokol Layer Transport.  Karakteristik Protokol Layer Network.  Pengalamatan IP. Subnetting. Karakeristik Layer Datalink. Protokol Routing.  Dynamic Routing Protocol  . Wide Area Network .   Wireless Local Area Network (WLAN).  Virtual Local Area Network (VLAN). Pengantar Cloud Computing", "type": "pb"},
	{"kalimat": "Fenomena Keamanan Informasi dan Internet   Hackers dan Kerawanan Sistem   Serangan dan Strategi Pengamanan   Penyusunan Kebijakan dan Prosedur Keamanan   Transaksi Elektronik dan Bukti Digital", "type": "pb"},
	{"kalimat": "PERSPEKTIF UTAMA SISTEM ORGANISASI   PENGELOLAAN TEKNOLOGI INFORMASI   MEMBUDAYAKAN LITERASI INFORMASI   SISTEM SENTRALISASI DAN DESENTRALISASI ORGANISASI   TREN STRUKTUR ORGANISASI ABAD-21   PERENCANAAN DAN PENGATURAN   PENGADAAN DAN PENERAPAN   INTEGRASI DAN SHARED-SERVICES ORGANISATION   PRINSIP IT GOVERNANCE   MANAJEMEN PERUBAHAN   STANDAR ISO-38500   STUDI KASUS LAPANGAN", "type": "pb"},
	{"kalimat": "pembuatan proposal penanganan SDM penanganan Sumber Daya Keuangan", "type": "pb"},
	{"kalimat": "1) Dasar-Dasar Manajemen dan Organisasi dalam Manajemen Global 2) Dasar-Dasar Perencanaan dan Manajemen Strategik 3) Dasar-Dasar Pengoordinasian dan Mengelola Perubahan 4) Kepemimpinan dan Motivasi 5) Komunikasi dan Dasar-Dasar Pengendalian 6) Pemahaman Bagaimana Ekonomi Memengaruhi Bisnis dan Tanggung Jawab Perilaku secara Sosial 7) Bagaimana Membentuk suatu Bisnis dan Kewirausahaan Memulai suatu Usaha Kecil 8) Manajemen Produksi dan Operasi 9) Pemasaran: Membantu Pembeli Membeli 10) Manajemen Keuangan", "type": "pb"},
	{"kalimat": "Prinsip-prinsip perancangan perangkat lunak: abstraksi; kopling dan kohesi; dekomposisi dan modularisasi; enkapsulasi; pemisahan antara antarmuka dan implementasi; sufficiency, completeness, dan primitiveness; serta separation of concerns. Isu-isu kunci perancangan perangkat lunak: konkurensi, penanganan event, persistensi data, penanganan error, toleransi terhadap kesalahan, keamanan, dll. Tipe-tipe perangkat lunak. Pendekatan perancangan perangkat lunak: top-down, bottom-up, function-oriented, data structure-centered, object-oriented, dan component-based. Konsep-konsep arsitektur perangkat lunak: client-server, three-tier, Model-View-Controller, dll. Pola-pola perancangan: beberapa pola sesuai dengan permasalahan seperti creational patterns, structural patterns, dan behavioral patterns. Penggunaan kembali kerangka kerja. Perancangan antarmuka.", "type": "pb"},
	{"kalimat": "1.Pemahaman mengenai Rencana Strategis Sistem Informasi  2.Evolusi Perkembangan Sistem dan Teknologi Informasi dalam Organisasi  3.Pendifinisian Kebutuhan dan Strategi Bisnis  4.Pengembangan Strategi Sistem dan Teknologi Informasi  5.Analisa Strategi: Pemahaman Situasi Termutakhir  6.Analisa Strategi: Penentuan Target Masa Depan  7.Tata Kelola Portofolio Manajemen Aplikasi  8.Manajemen Strategi Sistem dan Teknologi Informasi  9.Eksplorasi Variasi Pendekatan Sistem dan Teknologi Informasi   10.Pengelolaan Ketersediaan Teknologi Informasi  11.Manajemen Informasi dan Pengetahuan  12.Perencanaan Strategis ke Depan", "type": "pb"},
	{"kalimat": "Mata Kuliah ini memuat materi Statistik dan statistika Pendidikan, Data Statistik, Distribusi Frekuesni, Ukuran Pemusatan, Ukuran Letak dan Ukuran Penyebaran, Distribusi Sampling dan Teori Menaksir, Hipotesis, Uji Rata-rata, Uji t, Regresi Linier, dan ANAVA.", "type": "pb"},
	{"kalimat": "Terdapat 14 (empat belas) pokok bahasan yang harus dikuasai secara penuh oleh peserta didik, masing-masing adalah sebagai berikut:  1. PERANAN TIK DALAM DUNIA PENDIDIKAN  2. KONTEKS TIK DALAM PENDIDIKAN TINGGI  3. KERANGKA ARSITEKTUR TIK DALAM KAMPUS  4. PENGUKURAN KINERJA TIK PERGURUAN TINGGI  5. MANAJEMEN TATA KELOLA TIK DI PERGURUAN TINGGI  6. MENANAMKAN BUDAYA TIK DI KAMPUS  7. TIK DAN PARADIGMA PENDIDIKAN ABAD XXI  8. FENOMENA OPEN COURSEWARE  9. MENGADOPSI PERGESERAN PARADIGMA PENDIDIKAN  10. KEKAYAAN KONTEN DI DUNIA MAYA  11. KONSEP OPEN EDUCATION DAN TANTANGANNYA  12. MENGGALI MANFAAT OPEN EDUCATION  13. INSTRUMEN EVALUASI ADOPSI TEKNOLOGI INFORMASI  14. STRATEGI IMPLEMENTASI E-LEARNING", "type": "pb"},
	{"kalimat": "Sistem Komputer: Pengertian dan FungsiSistemOperasiKomputer, Konsep-konsepSistemOperasi, StrukturSistem Operasi, Layanan, Kegiatan, dan JenissistemOperasi, SejarahPerkembanganSistemOperasi,Manajemen Proses:Model Proses, Ststus Proses, ImplementasiSistem, KomunikasiAntar Proses, Proses DalamSistemTerdistribusi, Teknik Penjadwalan Proses: Preemptive Scheduling, Non-preemtive Scheduling, TeknikPenjadwalanSatu Tingkat, TeknikPenjadwalanMultitingkat, MetodeEvaluasiPenjadwalan, Manajemen Memori: Pengertiandan JenisMemori, AlamatMemori, Isi Memori, ManajemenMemoritanpa Swapping atau Paging, Multiprogramming denganPartisiStatis, Swapping, AnalisisSistem Swap, Virtual Memori, AlgoritmaPenempatan page, DesainSistem Paging, ImplementasiSegmentasi, Manajemen File: File, Directory,ImplementasiSistem File, Pengamanan File, User Authentication,  Installasi, konfigurasi dan mengelola Sistem Operasi: Windows, Linux, JavaVirtual Machine.", "type": "pb"},
	{"kalimat": "CSS\tJavascript\tHTML 5", "type": "pb"},
	{"kalimat": "Jaringan", "type": "pb"},
	{"kalimat": "Mahasiswa akan mempelajari teknik-teknik pengolahan data teks untuk menemukan kembali informasi pada data berbentuk teks. Bahasan perkuliahan meliputi pengolahan awal, ekstraksi fitur, penghitungan tingkat kemiripan teks sesuai masukan query, dan menampilkan hasil pencarian. Bahasan lanjut adalah teknik relevance feedback, klasifikasi dan klasterisasi teks untuk membantu pengguna dalam pencarian. Mahasiswa akan merancang, menganalisis serta mengaplikasikan metode-metode sistem temu kembali informasi pada berbagai permasalahan nyata baik secara mandiri atau kerjasama tim.", "type": "pb"},
	{"kalimat": "MINGGU 1 Pemanfaatan Teknologi Informasi. MINGGU 2 Ancaman-ancaman terhadap Penggunaan Teknologi Informasi. MINGGU 3 Prinsip-prinsip Keamanan Informasi – Part 1. MINGGU 4 Prinsip-prinsip Keamanan Informasi – Part 2.", "type": "pb"},
	{"kalimat": "Mempelajari Materi Dasar Pemrograman Untuk Pemula (Part 1). Mengerjakan Test Dasar Pemrograman Untuk Pemula (Part 1).", "type": "pb"},
	{"kalimat": "Topik-topik yang akan dibahas meliputi: Relasi beserta sifat-sifat dan aplikasinya, Penutup relasi, Relasi ekivalen, Terurut parsial, Terurut total, Relasi rekurensi, fungsi Pembangkit, Graf, Isomorfisma graf, Keterhubungan graf, Komponen, Lintasan, Sirkuit, Lintasan dan Sirkuit Euler, Lintas dan Sirkuit Hamilton, Lintasan Terpendek, Graf Planar, Pewarnaan graf, Pohon, Hutan, Pohon perentang, Pohon perentang minimum, cut set.", "type": "pb"}
]